[
    {
        "title": "Sentiment Identification in Code-Mixed Social Media Text",
        "abstract": "Sentiment analysis is the Natural Language Processing (NLP) task dealing with\nthe detection and classification of sentiments in texts. While some tasks deal\nwith identifying the presence of sentiment in the text (Subjectivity analysis),\nother tasks aim at determining the polarity of the text categorizing them as\npositive, negative and neutral. Whenever there is a presence of sentiment in\nthe text, it has a source (people, group of people or any entity) and the\nsentiment is directed towards some entity, object, event or person. Sentiment\nanalysis tasks aim to determine the subject, the target and the polarity or\nvalence of the sentiment. In our work, we try to automatically extract\nsentiment (positive or negative) from Facebook posts using a machine learning\napproach.While some works have been done in code-mixed social media data and in\nsentiment analysis separately, our work is the first attempt (as of now) which\naims at performing sentiment analysis of code-mixed social media text. We have\nused extensive pre-processing to remove noise from raw text. Multilayer\nPerceptron model has been used to determine the polarity of the sentiment. We\nhave also developed the corpus for this task by manually labeling Facebook\nposts with their associated sentiments.",
        "link": "http://arxiv.org/abs/1707.01184v1",
        "published": "2017-07-04T23:29:44Z",
        "pdf_url": "http://arxiv.org/pdf/1707.01184v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_1.pdf"
    },
    {
        "title": "A longitudinal sentiment analysis of Sinophobia during COVID-19 using\n  large language models",
        "abstract": "The COVID-19 pandemic has exacerbated xenophobia, particularly Sinophobia,\nleading to widespread discrimination against individuals of Chinese descent.\nLarge language models (LLMs) are pre-trained deep learning models used for\nnatural language processing (NLP) tasks. The ability of LLMs to understand and\ngenerate human-like text makes them particularly useful for analysing social\nmedia data to detect and evaluate sentiments. We present a sentiment analysis\nframework utilising LLMs for longitudinal sentiment analysis of the Sinophobic\nsentiments expressed in X (Twitter) during the COVID-19 pandemic. The results\nshow a significant correlation between the spikes in Sinophobic tweets,\nSinophobic sentiments and surges in COVID-19 cases, revealing that the\nevolution of the pandemic influenced public sentiment and the prevalence of\nSinophobic discourse. Furthermore, the sentiment analysis revealed a\npredominant presence of negative sentiments, such as annoyance and denial,\nwhich underscores the impact of political narratives and misinformation shaping\npublic opinion. The lack of empathetic sentiment which was present in previous\nstudies related to COVID-19 highlights the way the political narratives in\nmedia viewed the pandemic and how it blamed the Chinese community. Our study\nhighlights the importance of transparent communication in mitigating xenophobic\nsentiments during global crises.",
        "link": "http://arxiv.org/abs/2408.16942v1",
        "published": "2024-08-29T23:39:11Z",
        "pdf_url": "http://arxiv.org/pdf/2408.16942v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_2.pdf"
    },
    {
        "title": "Emotional Analysis of Fashion Trends Using Social Media and AI:\n  Sentiment Analysis on Twitter for Fashion Trend Forecasting",
        "abstract": "This study explores the intersection of fashion trends and social media\nsentiment through computational analysis of Twitter data using the T4SA\n(Twitter for Sentiment Analysis) dataset. By applying natural language\nprocessing and machine learning techniques, we examine how sentiment patterns\nin fashion-related social media conversations can serve as predictors for\nemerging fashion trends. Our analysis involves the identification and\ncategorization of fashion-related content, sentiment classification with\nimproved normalization techniques, time series decomposition, statistically\nvalidated causal relationship modeling, cross-platform sentiment comparison,\nand brand-specific sentiment analysis. Results indicate correlations between\nsentiment patterns and fashion theme popularity, with accessories and\nstreetwear themes showing statistically significant rising trends. The Granger\ncausality analysis establishes sustainability and streetwear as primary trend\ndrivers, showing bidirectional relationships with several other themes. The\nfindings demonstrate that social media sentiment analysis can serve as an\neffective early indicator of fashion trend trajectories when proper statistical\nvalidation is applied. Our improved predictive model achieved 78.35% balanced\naccuracy in sentiment classification, establishing a reliable foundation for\ntrend prediction across positive, neutral, and negative sentiment categories.",
        "link": "http://arxiv.org/abs/2505.00050v1",
        "published": "2025-04-30T07:27:06Z",
        "pdf_url": "http://arxiv.org/pdf/2505.00050v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_3.pdf"
    },
    {
        "title": "Twitter Sentiment Analysis System",
        "abstract": "Social media is increasingly used by humans to express their feelings and\nopinions in the form of short text messages. Detecting sentiments in the text\nhas a wide range of applications including identifying anxiety or depression of\nindividuals and measuring well-being or mood of a community. Sentiments can be\nexpressed in many ways that can be seen such as facial expression and gestures,\nspeech and by written text. Sentiment Analysis in text documents is essentially\na content-based classification problem involving concepts from the domains of\nNatural Language Processing as well as Machine Learning. In this paper,\nsentiment recognition based on textual data and the techniques used in\nsentiment analysis are discussed.",
        "link": "http://arxiv.org/abs/1807.07752v1",
        "published": "2018-07-20T09:19:08Z",
        "pdf_url": "http://arxiv.org/pdf/1807.07752v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_4.pdf"
    },
    {
        "title": "Sentiment Analysis of Spanish Political Party Tweets Using Pre-trained\n  Language Models",
        "abstract": "Title: Sentiment Analysis of Spanish Political Party Communications on\nTwitter Using Pre-trained Language Models\n  Authors: Chuqiao Song, Shunzhang Chen, Xinyi Cai, Hao Chen\n  Comments: 21 pages, 6 figures\n  Abstract: This study investigates sentiment patterns within Spanish political\nparty communications on Twitter by leveraging BETO and RoBERTuito, two\npre-trained language models optimized for Spanish text. Using a dataset of\ntweets from major Spanish political parties: PSOE, PP, Vox, Podemos, and\nCiudadanos, spanning 2019 to 2024, this research analyzes sentiment\ndistributions and explores the relationship between sentiment expression and\nparty ideology. The findings indicate that both models consistently identify a\npredominant Neutral sentiment across all parties, with significant variations\nin Negative and Positive sentiments that align with ideological distinctions.\nSpecifically, Vox exhibits higher levels of Negative sentiment, while PSOE\ndemonstrates relatively high Positive sentiment, supporting the hypothesis that\nemotional appeals in political messaging reflect ideological stances. This\nstudy underscores the potential of pre-trained language models for non-English\nsentiment analysis on social media, providing insights into sentiment dynamics\nthat shape public discourse within Spain's multi-party political system.\n  Keywords: Spanish politics, sentiment analysis, pre-trained language models,\nTwitter, BETO, RoBERTuito, political ideology, multi-party system",
        "link": "http://arxiv.org/abs/2411.04862v1",
        "published": "2024-11-07T16:53:09Z",
        "pdf_url": "http://arxiv.org/pdf/2411.04862v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_5.pdf"
    },
    {
        "title": "Sentiment Analysis: A Survey",
        "abstract": "Sentiment analysis (also known as opinion mining) refers to the use of\nnatural language processing, text analysis and computational linguistics to\nidentify and extract subjective information in source materials. Mining\nopinions expressed in the user generated content is a challenging yet\npractically very useful problem. This survey would cover various approaches and\nmethodology used in Sentiment Analysis and Opinion Mining in general. The focus\nwould be on Internet text like, Product review, tweets and other social media.",
        "link": "http://arxiv.org/abs/1405.2584v1",
        "published": "2014-05-11T21:05:28Z",
        "pdf_url": "http://arxiv.org/pdf/1405.2584v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_6.pdf"
    },
    {
        "title": "Towards Financial Sentiment Analysis in a South African Landscape",
        "abstract": "Sentiment analysis as a sub-field of natural language processing has received\nincreased attention in the past decade enabling organisations to more\neffectively manage their reputation through online media monitoring. Many\ndrivers impact reputation, however, this thesis focuses only the aspect of\nfinancial performance and explores the gap with regards to financial sentiment\nanalysis in a South African context. Results showed that pre-trained sentiment\nanalysers are least effective for this task and that traditional lexicon-based\nand machine learning approaches are best suited to predict financial sentiment\nof news articles. The evaluated methods produced accuracies of 84\\%-94\\%. The\npredicted sentiments correlated quite well with share price and highlighted the\npotential use of sentiment as an indicator of financial performance. A main\ncontribution of the study was updating an existing sentiment dictionary for\nfinancial sentiment analysis. Model generalisation was less acceptable due to\nthe limited amount of training data used. Future work includes expanding the\ndata set to improve general usability and contribute to an open-source\nfinancial sentiment analyser for South African data.",
        "link": "http://arxiv.org/abs/2106.10004v1",
        "published": "2021-06-18T08:48:47Z",
        "pdf_url": "http://arxiv.org/pdf/2106.10004v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_7.pdf"
    },
    {
        "title": "A Convolutional Neural Network for Aspect Sentiment Classification",
        "abstract": "With the development of the Internet, natural language processing (NLP), in\nwhich sentiment analysis is an important task, became vital in information\nprocessing.Sentiment analysis includes aspect sentiment classification. Aspect\nsentiment can provide complete and in-depth results with increased attention on\naspect-level. Different context words in a sentence influence the sentiment\npolarity of a sentence variably, and polarity varies based on the different\naspects in a sentence. Take the sentence, 'I bought a new camera. The picture\nquality is amazing but the battery life is too short.'as an example. If the\naspect is picture quality, then the expected sentiment polarity is 'positive',\nif the battery life aspect is considered, then the sentiment polarity should be\n'negative'; therefore, aspect is important to consider when we explore aspect\nsentiment in the sentence. Recurrent neural network (RNN) is regarded as a good\nmodel to deal with natural language processing, and RNNs has get good\nperformance on aspect sentiment classification including Target-Dependent LSTM\n(TD-LSTM) ,Target-Connection LSTM (TC-LSTM) (Tang, 2015a, b), AE-LSTM, AT-LSTM,\nAEAT-LSTM (Wang et al., 2016).There are also extensive literatures on sentiment\nclassification utilizing convolutional neural network, but there is little\nliterature on aspect sentiment classification using convolutional neural\nnetwork. In our paper, we develop attention-based input layers in which aspect\ninformation is considered by input layer. We then incorporate attention-based\ninput layers into convolutional neural network (CNN) to introduce context words\ninformation. In our experiment, incorporating aspect information into CNN\nimproves the latter's aspect sentiment classification performance without using\nsyntactic parser or external sentiment lexicons in a benchmark dataset from\nTwitter but get better performance compared with other models.",
        "link": "http://arxiv.org/abs/1807.01704v1",
        "published": "2018-07-04T09:07:34Z",
        "pdf_url": "http://arxiv.org/pdf/1807.01704v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_8.pdf"
    },
    {
        "title": "LexiPers: An ontology based sentiment lexicon for Persian",
        "abstract": "Sentiment analysis refers to the use of natural language processing to\nidentify and extract subjective information from textual resources. One\napproach for sentiment extraction is using a sentiment lexicon. A sentiment\nlexicon is a set of words associated with the sentiment orientation that they\nexpress. In this paper, we describe the process of generating a general purpose\nsentiment lexicon for Persian. A new graph-based method is introduced for seed\nselection and expansion based on an ontology. Sentiment lexicon generation is\nthen mapped to a document classification problem. We used the K-nearest\nneighbors and nearest centroid methods for classification. These classifiers\nhave been evaluated based on a set of hand labeled synsets. The final sentiment\nlexicon has been generated by the best classifier. The results show an\nacceptable performance in terms of accuracy and F-measure in the generated\nsentiment lexicon.",
        "link": "http://arxiv.org/abs/1911.05263v1",
        "published": "2019-11-13T02:48:33Z",
        "pdf_url": "http://arxiv.org/pdf/1911.05263v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_9.pdf"
    },
    {
        "title": "Learning to Extract Cross-Domain Aspects and Understanding Sentiments\n  Using Large Language Models",
        "abstract": "Aspect-based sentiment analysis (ASBA) is a refined approach to sentiment\nanalysis that aims to extract and classify sentiments based on specific aspects\nor features of a product, service, or entity. Unlike traditional sentiment\nanalysis, which assigns a general sentiment score to entire reviews or texts,\nABSA focuses on breaking down the text into individual components or aspects\n(e.g., quality, price, service) and evaluating the sentiment towards each. This\nallows for a more granular level of understanding of customer opinions,\nenabling businesses to pinpoint specific areas of strength and improvement. The\nprocess involves several key steps, including aspect extraction, sentiment\nclassification, and aspect-level sentiment aggregation for a review paragraph\nor any other form that the users have provided. ABSA has significant\napplications in areas such as product reviews, social media monitoring,\ncustomer feedback analysis, and market research. By leveraging techniques from\nnatural language processing (NLP) and machine learning, ABSA facilitates the\nextraction of valuable insights, enabling companies to make data-driven\ndecisions that enhance customer satisfaction and optimize offerings. As ABSA\nevolves, it holds the potential to greatly improve personalized customer\nexperiences by providing a deeper understanding of sentiment across various\nproduct aspects. In this work, we have analyzed the strength of LLMs for a\ncomplete cross-domain aspect-based sentiment analysis with the aim of defining\nthe framework for certain products and using it for other similar situations.\nWe argue that it is possible to that at an effectiveness of 92\\% accuracy for\nthe Aspect Based Sentiment Analysis dataset of SemEval-2015 Task 12.",
        "link": "http://arxiv.org/abs/2501.08974v1",
        "published": "2025-01-15T17:36:56Z",
        "pdf_url": "http://arxiv.org/pdf/2501.08974v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_10.pdf"
    },
    {
        "title": "Indo LEGO-ABSA: A Multitask Generative Aspect Based Sentiment Analysis\n  for Indonesian Language",
        "abstract": "Aspect-based sentiment analysis is a method in natural language processing\naimed at identifying and understanding sentiments related to specific aspects\nof an entity. Aspects are words or phrases that represent an aspect or\nattribute of a particular entity. Previous research has utilized generative\npre-trained language models to perform aspect-based sentiment analysis.\nLEGO-ABSA is one framework that has successfully employed generative\npre-trained language models in aspect-based sentiment analysis, particularly in\nEnglish. LEGO-ABSA uses a multitask learning and prompting approach to enhance\nmodel performance. However, the application of this approach has not been done\nin the context of Bahasa Indonesia. Therefore, this research aims to implement\nthe multitask learning and prompting approach in aspect-based sentiment\nanalysis for Bahasa Indonesia using generative pre-trained language models. In\nthis study, the Indo LEGO-ABSA model is developed, which is an aspect-based\nsentiment analysis model utilizing generative pre-trained language models and\ntrained with multitask learning and prompting. Indo LEGO-ABSA is trained with a\nhotel domain dataset in the Indonesian language. The obtained results include\nan f1-score of 79.55% for the Aspect Sentiment Triplet Extraction task, 86.09%\nfor Unified Aspect-based Sentiment Analysis, 79.85% for Aspect Opinion Pair\nExtraction, 87.45% for Aspect Term Extraction, and 88.09% for Opinion Term\nExtraction. Indo LEGO-ABSA adopts the LEGO-ABSA framework that employs the T5\nmodel, specifically mT5, by applying multitask learning to train all tasks\nwithin aspect-based sentiment analysis.",
        "link": "http://arxiv.org/abs/2311.01757v1",
        "published": "2023-11-03T07:28:12Z",
        "pdf_url": "http://arxiv.org/pdf/2311.01757v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_11.pdf"
    },
    {
        "title": "Distinguishing Clinical Sentiment: The Importance of Domain Adaptation\n  in Psychiatric Patient Health Records",
        "abstract": "Recently natural language processing (NLP) tools have been developed to\nidentify and extract salient risk indicators in electronic health records\n(EHRs). Sentiment analysis, although widely used in non-medical areas for\nimproving decision making, has been studied minimally in the clinical setting.\nIn this study, we undertook, to our knowledge, the first domain adaptation of\nsentiment analysis to psychiatric EHRs by defining psychiatric clinical\nsentiment, performing an annotation project, and evaluating multiple\nsentence-level sentiment machine learning (ML) models. Results indicate that\noff-the-shelf sentiment analysis tools fail in identifying clinically positive\nor negative polarity, and that the definition of clinical sentiment that we\nprovide is learnable with relatively small amounts of training data. This\nproject is an initial step towards further refining sentiment analysis methods\nfor clinical use. Our long-term objective is to incorporate the results of this\nproject as part of a machine learning model that predicts inpatient readmission\nrisk. We hope that this work will initiate a discussion concerning domain\nadaptation of sentiment analysis to the clinical setting.",
        "link": "http://arxiv.org/abs/1904.03225v1",
        "published": "2019-04-05T18:33:22Z",
        "pdf_url": "http://arxiv.org/pdf/1904.03225v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_12.pdf"
    },
    {
        "title": "Large language models in finance : what is financial sentiment?",
        "abstract": "Financial sentiment has become a crucial yet complex concept in finance,\nincreasingly used in market forecasting and investment strategies. Despite its\ngrowing importance, there remains a need to define and understand what\nfinancial sentiment truly represents and how it can be effectively measured. We\nexplore the nature of financial sentiment and investigate how large language\nmodels (LLMs) contribute to its estimation. We trace the evolution of sentiment\nmeasurement in finance, from market-based and lexicon-based methods to advanced\nnatural language processing techniques. The emergence of LLMs has significantly\nenhanced sentiment analysis, providing deeper contextual understanding and\ngreater accuracy in extracting sentiment from financial text. We examine how\nBERT-based models, such as RoBERTa and FinBERT, are optimized for structured\nsentiment classification, while GPT-based models, including GPT-4, OPT, and\nLLaMA, excel in financial text generation and real-time sentiment\ninterpretation. A comparative analysis of bidirectional and autoregressive\ntransformer architectures highlights their respective roles in investor\nsentiment analysis, algorithmic trading, and financial decision-making. By\nexploring what financial sentiment is and how it is estimated within LLMs, we\nprovide insights into the growing role of AI-driven sentiment analysis in\nfinance.",
        "link": "http://arxiv.org/abs/2503.03612v4",
        "published": "2025-03-05T15:51:25Z",
        "pdf_url": "http://arxiv.org/pdf/2503.03612v4",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_13.pdf"
    },
    {
        "title": "SentiQNF: A Novel Approach to Sentiment Analysis Using Quantum\n  Algorithms and Neuro-Fuzzy Systems",
        "abstract": "Sentiment analysis is an essential component of natural language processing,\nused to analyze sentiments, attitudes, and emotional tones in various contexts.\nIt provides valuable insights into public opinion, customer feedback, and user\nexperiences. Researchers have developed various classical machine learning and\nneuro-fuzzy approaches to address the exponential growth of data and the\ncomplexity of language structures in sentiment analysis. However, these\napproaches often fail to determine the optimal number of clusters, interpret\nresults accurately, handle noise or outliers efficiently, and scale effectively\nto high-dimensional data. Additionally, they are frequently insensitive to\ninput variations. In this paper, we propose a novel hybrid approach for\nsentiment analysis called the Quantum Fuzzy Neural Network (QFNN), which\nleverages quantum properties and incorporates a fuzzy layer to overcome the\nlimitations of classical sentiment analysis algorithms. In this study, we test\nthe proposed approach on two Twitter datasets: the Coronavirus Tweets Dataset\n(CVTD) and the General Sentimental Tweets Dataset (GSTD), and compare it with\nclassical and hybrid algorithms. The results demonstrate that QFNN outperforms\nall classical, quantum, and hybrid algorithms, achieving 100% and 90% accuracy\nin the case of CVTD and GSTD, respectively. Furthermore, QFNN demonstrates its\nrobustness against six different noise models, providing the potential to\ntackle the computational complexity associated with sentiment analysis on a\nlarge scale in a noisy environment. The proposed approach expedites sentiment\ndata processing and precisely analyses different forms of textual data, thereby\nenhancing sentiment classification and insights associated with sentiment\nanalysis.",
        "link": "http://arxiv.org/abs/2412.12731v2",
        "published": "2024-12-17T09:54:17Z",
        "pdf_url": "http://arxiv.org/pdf/2412.12731v2",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_14.pdf"
    },
    {
        "title": "Identification of Bias Against People with Disabilities in Sentiment\n  Analysis and Toxicity Detection Models",
        "abstract": "Sociodemographic biases are a common problem for natural language processing,\naffecting the fairness and integrity of its applications. Within sentiment\nanalysis, these biases may undermine sentiment predictions for texts that\nmention personal attributes that unbiased human readers would consider neutral.\nSuch discrimination can have great consequences in the applications of\nsentiment analysis both in the public and private sectors. For example,\nincorrect inferences in applications like online abuse and opinion analysis in\nsocial media platforms can lead to unwanted ramifications, such as wrongful\ncensoring, towards certain populations. In this paper, we address the\ndiscrimination against people with disabilities, PWD, done by sentiment\nanalysis and toxicity classification models. We provide an examination of\nsentiment and toxicity analysis models to understand in detail how they\ndiscriminate PWD. We present the Bias Identification Test in Sentiments (BITS),\na corpus of 1,126 sentences designed to probe sentiment analysis models for\nbiases in disability. We use this corpus to demonstrate statistically\nsignificant biases in four widely used sentiment analysis tools (TextBlob,\nVADER, Google Cloud Natural Language API and DistilBERT) and two toxicity\nanalysis models trained to predict toxic comments on Jigsaw challenges (Toxic\ncomment classification and Unintended Bias in Toxic comments). The results show\nthat all exhibit strong negative biases on sentences that mention disability.\nWe publicly release BITS Corpus for others to identify potential biases against\ndisability in any sentiment analysis tools and also to update the corpus to be\nused as a test for other sociodemographic variables as well.",
        "link": "http://arxiv.org/abs/2111.13259v1",
        "published": "2021-11-25T21:44:18Z",
        "pdf_url": "http://arxiv.org/pdf/2111.13259v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_15.pdf"
    },
    {
        "title": "Optimization Techniques for Sentiment Analysis Based on LLM (GPT-3)",
        "abstract": "With the rapid development of natural language processing (NLP) technology,\nlarge-scale pre-trained language models such as GPT-3 have become a popular\nresearch object in NLP field. This paper aims to explore sentiment analysis\noptimization techniques based on large pre-trained language models such as\nGPT-3 to improve model performance and effect and further promote the\ndevelopment of natural language processing (NLP). By introducing the importance\nof sentiment analysis and the limitations of traditional methods, GPT-3 and\nFine-tuning techniques are introduced in this paper, and their applications in\nsentiment analysis are explained in detail. The experimental results show that\nthe Fine-tuning technique can optimize GPT-3 model and obtain good performance\nin sentiment analysis task. This study provides an important reference for\nfuture sentiment analysis using large-scale language models.",
        "link": "http://arxiv.org/abs/2405.09770v1",
        "published": "2024-05-16T02:21:13Z",
        "pdf_url": "http://arxiv.org/pdf/2405.09770v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_16.pdf"
    },
    {
        "title": "Sentiment analysis and opinion mining on educational data: A survey",
        "abstract": "Sentiment analysis AKA opinion mining is one of the most widely used NLP\napplications to identify human intentions from their reviews. In the education\nsector, opinion mining is used to listen to student opinions and enhance their\nlearning-teaching practices pedagogically. With advancements in sentiment\nannotation techniques and AI methodologies, student comments can be labelled\nwith their sentiment orientation without much human intervention. In this\nreview article, (1) we consider the role of emotional analysis in education\nfrom four levels: document level, sentence level, entity level, and aspect\nlevel, (2) sentiment annotation techniques including lexicon-based and\ncorpus-based approaches for unsupervised annotations are explored, (3) the role\nof AI in sentiment analysis with methodologies like machine learning, deep\nlearning, and transformers are discussed, (4) the impact of sentiment analysis\non educational procedures to enhance pedagogy, decision-making, and evaluation\nare presented. Educational institutions have been widely invested to build\nsentiment analysis tools and process their student feedback to draw their\nopinions and insights. Applications built on sentiment analysis of student\nfeedback are reviewed in this study. Challenges in sentiment analysis like\nmulti-polarity, polysemous, negation words, and opinion spam detection are\nexplored and their trends in the research space are discussed. The future\ndirections of sentiment analysis in education are discussed.",
        "link": "http://arxiv.org/abs/2302.04359v1",
        "published": "2023-02-08T22:14:08Z",
        "pdf_url": "http://arxiv.org/pdf/2302.04359v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_17.pdf"
    },
    {
        "title": "Enhancing Affinity Propagation for Improved Public Sentiment Insights",
        "abstract": "With the large amount of data generated every day, public sentiment is a key\nfactor for various fields, including marketing, politics, and social research.\nUnderstanding the public sentiment about different topics can provide valuable\ninsights. However, most traditional approaches for sentiment analysis often\ndepend on supervised learning, which requires a significant amount of labeled\ndata. This makes it both expensive and time-consuming to implement. This\nproject introduces an approach using unsupervised learning techniques,\nparticularly Affinity Propagation (AP) clustering, to analyze sentiment. AP\nclustering groups text data based on natural patterns, without needing\npredefined cluster numbers. The paper compares AP with K-means clustering,\nusing TF-IDF Vectorization for text representation and Principal Component\nAnalysis (PCA) for dimensionality reduction. To enhance performance, AP is\ncombined with Agglomerative Hierarchical Clustering. This hybrid method refines\nclusters further, capturing both global and local sentiment structures more\neffectively. The effectiveness of these methods is evaluated using the\nSilhouette Score, Calinski-Harabasz Score, and Davies-Bouldin Index. Results\nshow that AP with Agglomerative Hierarchical Clustering significantly\noutperforms K-means. This research contributes to Natural Language Processing\n(NLP) by proposing a scalable and efficient unsupervised learning framework for\nsentiment analysis, highlighting the significant societal impact of advanced AI\ntechniques in analyzing public sentiment without the need for extensive labeled\ndata.",
        "link": "http://arxiv.org/abs/2410.12862v1",
        "published": "2024-10-12T19:20:33Z",
        "pdf_url": "http://arxiv.org/pdf/2410.12862v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_18.pdf"
    },
    {
        "title": "NUIG-Shubhanker@Dravidian-CodeMix-FIRE2020: Sentiment Analysis of\n  Code-Mixed Dravidian text using XLNet",
        "abstract": "Social media has penetrated into multilingual societies, however most of them\nuse English to be a preferred language for communication. So it looks natural\nfor them to mix their cultural language with English during conversations\nresulting in abundance of multilingual data, call this code-mixed data,\navailable in todays' world.Downstream NLP tasks using such data is challenging\ndue to the semantic nature of it being spread across multiple languages.One\nsuch Natural Language Processing task is sentiment analysis, for this we use an\nauto-regressive XLNet model to perform sentiment analysis on code-mixed\nTamil-English and Malayalam-English datasets.",
        "link": "http://arxiv.org/abs/2010.07773v1",
        "published": "2020-10-15T14:09:02Z",
        "pdf_url": "http://arxiv.org/pdf/2010.07773v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_19.pdf"
    },
    {
        "title": "Enhance Multi-domain Sentiment Analysis of Review Texts through\n  Prompting Strategies",
        "abstract": "Large Language Models (LLMs) have made significant strides in both scientific\nresearch and practical applications. Existing studies have demonstrated the\nstate-of-the-art (SOTA) performance of LLMs in various natural language\nprocessing tasks. However, the question of how to further enhance LLMs'\nperformance in specific task using prompting strategies remains a pivotal\nconcern. This paper explores the enhancement of LLMs' performance in sentiment\nanalysis through the application of prompting strategies. We formulate the\nprocess of prompting for sentiment analysis tasks and introduce two novel\nstrategies tailored for sentiment analysis: RolePlaying (RP) prompting and\nChain-of-thought (CoT) prompting. Specifically, we also propose the RP-CoT\nprompting strategy which is a combination of RP prompting and CoT prompting. We\nconduct comparative experiments on three distinct domain datasets to evaluate\nthe effectiveness of the proposed sentiment analysis strategies. The results\ndemonstrate that the adoption of the proposed prompting strategies leads to a\nincreasing enhancement in sentiment analysis accuracy. Further, the CoT\nprompting strategy exhibits a notable impact on implicit sentiment analysis,\nwith the RP-CoT prompting strategy delivering the most superior performance\namong all strategies.",
        "link": "http://arxiv.org/abs/2309.02045v2",
        "published": "2023-09-05T08:44:23Z",
        "pdf_url": "http://arxiv.org/pdf/2309.02045v2",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_20.pdf"
    },
    {
        "title": "Aspect-Based Sentiment Analysis using Local Context Focus Mechanism with\n  DeBERTa",
        "abstract": "Text sentiment analysis, also known as opinion mining, is research on the\ncalculation of people's views, evaluations, attitude and emotions expressed by\nentities. Text sentiment analysis can be divided into text-level sentiment\nanalysis, sen-tence-level sentiment analysis and aspect-level sentiment\nanalysis. Aspect-Based Sentiment Analysis (ABSA) is a fine-grained task in the\nfield of sentiment analysis, which aims to predict the polarity of aspects. The\nresearch of pre-training neural model has significantly improved the\nperformance of many natural language processing tasks. In recent years, pre\ntraining model (PTM) has been applied in ABSA. Therefore, there has been a\nquestion, which is whether PTMs contain sufficient syntactic information for\nABSA. In this paper, we explored the recent DeBERTa model (Decoding-enhanced\nBERT with disentangled attention) to solve Aspect-Based Sentiment Analysis\nproblem. DeBERTa is a kind of neural language model based on transformer, which\nuses self-supervised learning to pre-train on a large number of original text\ncorpora. Based on the Local Context Focus (LCF) mechanism, by integrating\nDeBERTa model, we purpose a multi-task learning model for aspect-based\nsentiment analysis. The experiments result on the most commonly used the laptop\nand restaurant datasets of SemEval-2014 and the ACL twitter dataset show that\nLCF mechanism with DeBERTa has significant improvement.",
        "link": "http://arxiv.org/abs/2207.02424v2",
        "published": "2022-07-06T03:50:31Z",
        "pdf_url": "http://arxiv.org/pdf/2207.02424v2",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_21.pdf"
    },
    {
        "title": "Visualizing Public Opinion on X: A Real-Time Sentiment Dashboard Using\n  VADER and DistilBERT",
        "abstract": "In the age of social media, understanding public sentiment toward major\ncorporations is crucial for investors, policymakers, and researchers. This\npaper presents a comprehensive sentiment analysis system tailored for corporate\nreputation monitoring, combining Natural Language Processing (NLP) and machine\nlearning techniques to accurately interpret public opinion in real time. The\nmethodology integrates a hybrid sentiment detection framework leveraging both\nrule-based models (VADER) and transformer-based deep learning models\n(DistilBERT), applied to social media data from multiple platforms. The system\nbegins with robust preprocessing involving noise removal and text\nnormalization, followed by sentiment classification using an ensemble approach\nto ensure both interpretability and contextual accuracy. Results are visualized\nthrough sentiment distribution plots, comparative analyses, and temporal\nsentiment trends for enhanced interpretability. Our analysis reveals\nsignificant disparities in public sentiment across major corporations, with\ncompanies like Amazon (81.2) and Samsung (45.8) receiving excellent sentiment\nscores, while Microsoft (21.7) and Walmart (21.9) exhibit poor sentiment\nprofiles. These findings demonstrate the utility of our multi-source sentiment\nframework in providing actionable insights regarding corporate public\nperception, enabling stakeholders to make informed strategic decisions based on\ncomprehensive sentiment analysis.",
        "link": "http://arxiv.org/abs/2504.15448v2",
        "published": "2025-04-21T21:33:55Z",
        "pdf_url": "http://arxiv.org/pdf/2504.15448v2",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_22.pdf"
    },
    {
        "title": "Sentiment analysis and opinion mining on E-commerce site",
        "abstract": "Sentiment analysis or opinion mining help to illustrate the phrase NLP\n(Natural Language Processing). Sentiment analysis has been the most significant\ntopic in recent years. The goal of this study is to solve the sentiment\npolarity classification challenges in sentiment analysis. A broad technique for\ncategorizing sentiment opposition is presented, along with comprehensive\nprocess explanations. With the results of the analysis, both sentence-level\nclassification and review-level categorization are conducted. Finally, we\ndiscuss our plans for future sentiment analysis research.",
        "link": "http://arxiv.org/abs/2211.15536v2",
        "published": "2022-11-28T16:43:33Z",
        "pdf_url": "http://arxiv.org/pdf/2211.15536v2",
        "pdf_path": null
    },
    {
        "title": "A comprehensive survey of contemporary Arabic sentiment analysis:\n  Methods, Challenges, and Future Directions",
        "abstract": "Sentiment Analysis, a popular subtask of Natural Language Processing, employs\ncomputational methods to extract sentiment, opinions, and other subjective\naspects from linguistic data. Given its crucial role in understanding human\nsentiment, research in sentiment analysis has witnessed significant growth in\nthe recent years. However, the majority of approaches are aimed at the English\nlanguage, and research towards Arabic sentiment analysis remains relatively\nunexplored. This paper presents a comprehensive and contemporary survey of\nArabic Sentiment Analysis, identifies the challenges and limitations of\nexisting literature in this field and presents avenues for future research. We\npresent a systematic review of Arabic sentiment analysis methods, focusing\nspecifically on research utilizing deep learning. We then situate Arabic\nSentiment Analysis within the broader context, highlighting research gaps in\nArabic sentiment analysis as compared to general sentiment analysis. Finally,\nwe outline the main challenges and promising future directions for research in\nArabic sentiment analysis.",
        "link": "http://arxiv.org/abs/2502.03827v1",
        "published": "2025-02-06T07:23:51Z",
        "pdf_url": "http://arxiv.org/pdf/2502.03827v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_24.pdf"
    },
    {
        "title": "SKEP: Sentiment Knowledge Enhanced Pre-training for Sentiment Analysis",
        "abstract": "Recently, sentiment analysis has seen remarkable advance with the help of\npre-training approaches. However, sentiment knowledge, such as sentiment words\nand aspect-sentiment pairs, is ignored in the process of pre-training, despite\nthe fact that they are widely used in traditional sentiment analysis\napproaches. In this paper, we introduce Sentiment Knowledge Enhanced\nPre-training (SKEP) in order to learn a unified sentiment representation for\nmultiple sentiment analysis tasks. With the help of automatically-mined\nknowledge, SKEP conducts sentiment masking and constructs three sentiment\nknowledge prediction objectives, so as to embed sentiment information at the\nword, polarity and aspect level into pre-trained sentiment representation. In\nparticular, the prediction of aspect-sentiment pairs is converted into\nmulti-label classification, aiming to capture the dependency between words in a\npair. Experiments on three kinds of sentiment tasks show that SKEP\nsignificantly outperforms strong pre-training baseline, and achieves new\nstate-of-the-art results on most of the test datasets. We release our code at\nhttps://github.com/baidu/Senta.",
        "link": "http://arxiv.org/abs/2005.05635v2",
        "published": "2020-05-12T09:23:32Z",
        "pdf_url": "http://arxiv.org/pdf/2005.05635v2",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_25.pdf"
    },
    {
        "title": "Extracting Emotion Phrases from Tweets using BART",
        "abstract": "Sentiment analysis is a natural language processing task that aims to\nidentify and extract the emotional aspects of a text. However, many existing\nsentiment analysis methods primarily classify the overall polarity of a text,\noverlooking the specific phrases that convey sentiment. In this paper, we\napplied an approach to sentiment analysis based on a question-answering\nframework. Our approach leverages the power of Bidirectional Autoregressive\nTransformer (BART), a pre-trained sequence-to-sequence model, to extract a\nphrase from a given text that amplifies a given sentiment polarity. We create a\nnatural language question that identifies the specific emotion to extract and\nthen guide BART to pay attention to the relevant emotional cues in the text. We\nuse a classifier within BART to predict the start and end positions of the\nanswer span within the text, which helps to identify the precise boundaries of\nthe extracted emotion phrase. Our approach offers several advantages over most\nsentiment analysis studies, including capturing the complete context and\nmeaning of the text and extracting precise token spans that highlight the\nintended sentiment. We achieved an end loss of 87% and Jaccard score of 0.61.",
        "link": "http://arxiv.org/abs/2403.14050v3",
        "published": "2024-03-21T00:20:16Z",
        "pdf_url": "http://arxiv.org/pdf/2403.14050v3",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_26.pdf"
    },
    {
        "title": "Sentiment Analysis in Poems in Misurata Sub-dialect -- A Sentiment\n  Detection in an Arabic Sub-dialect",
        "abstract": "Over the recent decades, there has been a significant increase and\ndevelopment of resources for Arabic natural language processing. This includes\nthe task of exploring Arabic Language Sentiment Analysis (ALSA) from Arabic\nutterances in both Modern Standard Arabic (MSA) and different Arabic dialects.\nThis study focuses on detecting sentiment in poems written in Misurata Arabic\nsub-dialect spoken in Misurata, Libya. The tools used to detect sentiment from\nthe dataset are Sklearn as well as Mazajak sentiment tool 1. Logistic\nRegression, Random Forest, Naive Bayes (NB), and Support Vector Machines (SVM)\nclassifiers are used with Sklearn, while the Convolutional Neural Network (CNN)\nis implemented with Mazajak. The results show that the traditional classifiers\nscore a higher level of accuracy as compared to Mazajak which is built on an\nalgorithm that includes deep learning techniques. More research is suggested to\nanalyze Arabic sub-dialect poetry in order to investigate the aspects that\ncontribute to sentiments in these multi-line texts; for example, the use of\nfigurative language such as metaphors.",
        "link": "http://arxiv.org/abs/2109.07203v1",
        "published": "2021-09-15T10:42:39Z",
        "pdf_url": "http://arxiv.org/pdf/2109.07203v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_27.pdf"
    },
    {
        "title": "Leveraging ChatGPT As Text Annotation Tool For Sentiment Analysis",
        "abstract": "Sentiment analysis is a well-known natural language processing task that\ninvolves identifying the emotional tone or polarity of a given piece of text.\nWith the growth of social media and other online platforms, sentiment analysis\nhas become increasingly crucial for businesses and organizations seeking to\nmonitor and comprehend customer feedback as well as opinions. Supervised\nlearning algorithms have been popularly employed for this task, but they\nrequire human-annotated text to create the classifier. To overcome this\nchallenge, lexicon-based tools have been used. A drawback of lexicon-based\nalgorithms is their reliance on pre-defined sentiment lexicons, which may not\ncapture the full range of sentiments in natural language. ChatGPT is a new\nproduct of OpenAI and has emerged as the most popular AI product. It can answer\nquestions on various topics and tasks. This study explores the use of ChatGPT\nas a tool for data labeling for different sentiment analysis tasks. It is\nevaluated on two distinct sentiment analysis datasets with varying purposes.\nThe results demonstrate that ChatGPT outperforms other lexicon-based\nunsupervised methods with significant improvements in overall accuracy.\nSpecifically, compared to the best-performing lexical-based algorithms, ChatGPT\nachieves a remarkable increase in accuracy of 20% for the tweets dataset and\napproximately 25% for the Amazon reviews dataset. These findings highlight the\nexceptional performance of ChatGPT in sentiment analysis tasks, surpassing\nexisting lexicon-based approaches by a significant margin. The evidence\nsuggests it can be used for annotation on different sentiment analysis events\nand taskss.",
        "link": "http://arxiv.org/abs/2306.17177v1",
        "published": "2023-06-18T12:20:42Z",
        "pdf_url": "http://arxiv.org/pdf/2306.17177v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_28.pdf"
    },
    {
        "title": "Development of a General Purpose Sentiment Lexicon for Igbo Language",
        "abstract": "There are publicly available general purpose sentiment lexicons in some high\nresource languages but very few exist in the low resource languages. This makes\nit difficult to directly perform sentiment analysis tasks in such languages.\nThe objective of this work is to create a general purpose sentiment lexicon for\nthe Igbo language that can determine the sentiment of documents written in the\nIgbo language without having to translate it to the English language. The\nmaterial used was an automatically translated lexicon by Liu and the manual\naddition of Igbo native words. The result of this work is a general purpose\nlexicon called IgboSentilex. The performance was tested on the BBC Igbo news\nchannel. It returned an average polarity agreement of 95.75 percent with other\ngeneral purpose sentiment lexicons.",
        "link": "http://arxiv.org/abs/2004.14176v1",
        "published": "2020-04-24T22:10:34Z",
        "pdf_url": "http://arxiv.org/pdf/2004.14176v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_29.pdf"
    },
    {
        "title": "Convolutional Neural Networks for Sentiment Analysis on Weibo Data: A\n  Natural Language Processing Approach",
        "abstract": "This study addressed the complex task of sentiment analysis on a dataset of\n119,988 original tweets from Weibo using a Convolutional Neural Network (CNN),\noffering a new approach to Natural Language Processing (NLP). The data, sourced\nfrom Baidu's PaddlePaddle AI platform, were meticulously preprocessed,\ntokenized, and categorized based on sentiment labels. A CNN-based model was\nutilized, leveraging word embeddings for feature extraction, and trained to\nperform sentiment classification. The model achieved a macro-average F1-score\nof approximately 0.73 on the test set, showing balanced performance across\npositive, neutral, and negative sentiments. The findings underscore the\neffectiveness of CNNs for sentiment analysis tasks, with implications for\npractical applications in social media analysis, market research, and policy\nstudies. The complete experimental content and code have been made publicly\navailable on the Kaggle data platform for further research and development.\nFuture work may involve exploring different architectures, such as Recurrent\nNeural Networks (RNN) or transformers, or using more complex pre-trained models\nlike BERT, to further improve the model's ability to understand linguistic\nnuances and context.",
        "link": "http://arxiv.org/abs/2307.06540v1",
        "published": "2023-07-13T03:02:56Z",
        "pdf_url": "http://arxiv.org/pdf/2307.06540v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_30.pdf"
    },
    {
        "title": "Constructing Financial Sentimental Factors in Chinese Market Using\n  Natural Language Processing",
        "abstract": "In this paper, we design an integrated algorithm to evaluate the sentiment of\nChinese market. Firstly, with the help of the web browser automation, we crawl\na lot of news and comments from several influential financial websites\nautomatically. Secondly, we use techniques of Natural Language Processing(NLP)\nunder Chinese context, including tokenization, Word2vec word embedding and\nsemantic database WordNet, to compute Senti-scores of these news and comments,\nand then construct the sentimental factor. Here, we build a finance-specific\nsentimental lexicon so that the sentimental factor can reflect the sentiment of\nfinancial market but not the general sentiments as happiness, sadness, etc.\nThirdly, we also implement an adjustment of the standard sentimental factor.\nOur experimental performance shows that there is a significant correlation\nbetween our standard sentimental factor and the Chinese market, and the\nadjusted factor is even more informative, having a stronger correlation with\nthe Chinese market. Therefore, our sentimental factors can be important\nreferences when making investment decisions. Especially during the Chinese\nmarket crash in 2015, the Pearson correlation coefficient of adjusted\nsentimental factor with SSE is 0.5844, which suggests that our model can\nprovide a solid guidance, especially in the special period when the market is\ninfluenced greatly by public sentiment.",
        "link": "http://arxiv.org/abs/1809.08390v1",
        "published": "2018-09-22T06:35:07Z",
        "pdf_url": "http://arxiv.org/pdf/1809.08390v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_31.pdf"
    },
    {
        "title": "Sentiment Classification of Code-Switched Text using Pre-trained\n  Multilingual Embeddings and Segmentation",
        "abstract": "With increasing globalization and immigration, various studies have estimated\nthat about half of the world population is bilingual. Consequently, individuals\nconcurrently use two or more languages or dialects in casual conversational\nsettings. However, most research is natural language processing is focused on\nmonolingual text. To further the work in code-switched sentiment analysis, we\npropose a multi-step natural language processing algorithm utilizing points of\ncode-switching in mixed text and conduct sentiment analysis around those\nidentified points. The proposed sentiment analysis algorithm uses semantic\nsimilarity derived from large pre-trained multilingual models with a\nhandcrafted set of positive and negative words to determine the polarity of\ncode-switched text. The proposed approach outperforms a comparable baseline\nmodel by 11.2% for accuracy and 11.64% for F1-score on a Spanish-English\ndataset. Theoretically, the proposed algorithm can be expanded for sentiment\nanalysis of multiple languages with limited human expertise.",
        "link": "http://arxiv.org/abs/2210.16461v1",
        "published": "2022-10-29T01:52:25Z",
        "pdf_url": "http://arxiv.org/pdf/2210.16461v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_32.pdf"
    },
    {
        "title": "Three-Class Text Sentiment Analysis Based on LSTM",
        "abstract": "Sentiment analysis is a crucial task in natural language processing (NLP)\nwith applications in public opinion monitoring, market research, and beyond.\nThis paper introduces a three-class sentiment classification method for Weibo\ncomments using Long Short-Term Memory (LSTM) networks to discern positive,\nneutral, and negative sentiments. LSTM, as a deep learning model, excels at\ncapturing long-distance dependencies in text data, providing significant\nadvantages over traditional machine learning approaches. Through preprocessing\nand feature extraction from Weibo comment texts, our LSTM model achieves\nprecise sentiment prediction. Experimental results demonstrate superior\nperformance, achieving an accuracy of 98.31% and an F1 score of 98.28%, notably\noutperforming conventional models and other deep learning methods. This\nunderscores the effectiveness of LSTM in capturing nuanced sentiment\ninformation within text, thereby enhancing classification accuracy. Despite its\nstrengths, the LSTM model faces challenges such as high computational\ncomplexity and slower processing times for lengthy texts. Moreover, complex\nemotional expressions like sarcasm and humor pose additional difficulties.\nFuture work could explore combining pre-trained models or advancing feature\nengineering techniques to further improve both accuracy and practicality.\nOverall, this study provides an effective solution for sentiment analysis on\nWeibo comments.",
        "link": "http://arxiv.org/abs/2412.17347v1",
        "published": "2024-12-23T07:21:07Z",
        "pdf_url": "http://arxiv.org/pdf/2412.17347v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_33.pdf"
    },
    {
        "title": "Social Media Sentiment Analysis for Cryptocurrency Market Prediction",
        "abstract": "In this paper, we explore the usability of different natural language\nprocessing models for the sentiment analysis of social media applied to\nfinancial market prediction, using the cryptocurrency domain as a reference. We\nstudy how the different sentiment metrics are correlated with the price\nmovements of Bitcoin. For this purpose, we explore different methods to\ncalculate the sentiment metrics from a text finding most of them not very\naccurate for this prediction task. We find that one of the models outperforms\nmore than 20 other public ones and makes it possible to fine-tune it\nefficiently given its interpretable nature. Thus we confirm that interpretable\nartificial intelligence and natural language processing methods might be more\nvaluable practically than non-explainable and non-interpretable ones. In the\nend, we analyse potential causal connections between the different sentiment\nmetrics and the price movements.",
        "link": "http://arxiv.org/abs/2204.10185v1",
        "published": "2022-04-19T03:27:29Z",
        "pdf_url": "http://arxiv.org/pdf/2204.10185v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_34.pdf"
    },
    {
        "title": "Sentiment Classification using Images and Label Embeddings",
        "abstract": "In this project we analysed how much semantic information images carry, and\nhow much value image data can add to sentiment analysis of the text associated\nwith the images. To better understand the contribution from images, we compared\nmodels which only made use of image data, models which only made use of text\ndata, and models which combined both data types. We also analysed if this\napproach could help sentiment classifiers generalize to unknown sentiments.",
        "link": "http://arxiv.org/abs/1712.00725v1",
        "published": "2017-12-03T07:20:15Z",
        "pdf_url": "http://arxiv.org/pdf/1712.00725v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_35.pdf"
    },
    {
        "title": "Large language model for Bible sentiment analysis: Sermon on the Mount",
        "abstract": "The revolution of natural language processing via large language models has\nmotivated its use in multidisciplinary areas that include social sciences and\nhumanities and more specifically, comparative religion. Sentiment analysis\nprovides a mechanism to study the emotions expressed in text. Recently,\nsentiment analysis has been used to study and compare translations of the\nBhagavad Gita, which is a fundamental and sacred Hindu text. In this study, we\nuse sentiment analysis for studying selected chapters of the Bible. These\nchapters are known as the Sermon on the Mount. We utilize a pre-trained\nlanguage model for sentiment analysis by reviewing five translations of the\nSermon on the Mount, which include the King James version, the New\nInternational Version, the New Revised Standard Version, the Lamsa Version, and\nthe Basic English Version. We provide a chapter-by-chapter and verse-by-verse\ncomparison using sentiment and semantic analysis and review the major\nsentiments expressed. Our results highlight the varying sentiments across the\nchapters and verses. We found that the vocabulary of the respective\ntranslations is significantly different. We detected different levels of\nhumour, optimism, and empathy in the respective chapters that were used by\nJesus to deliver his message.",
        "link": "http://arxiv.org/abs/2401.00689v1",
        "published": "2024-01-01T07:35:29Z",
        "pdf_url": "http://arxiv.org/pdf/2401.00689v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_36.pdf"
    },
    {
        "title": "SAIDS: A Novel Approach for Sentiment Analysis Informed of Dialect and\n  Sarcasm",
        "abstract": "Sentiment analysis becomes an essential part of every social network, as it\nenables decision-makers to know more about users' opinions in almost all life\naspects. Despite its importance, there are multiple issues it encounters like\nthe sentiment of the sarcastic text which is one of the main challenges of\nsentiment analysis. This paper tackles this challenge by introducing a novel\nsystem (SAIDS) that predicts the sentiment, sarcasm and dialect of Arabic\ntweets. SAIDS uses its prediction of sarcasm and dialect as known information\nto predict the sentiment. It uses MARBERT as a language model to generate\nsentence embedding, then passes it to the sarcasm and dialect models, and then\nthe outputs of the three models are concatenated and passed to the sentiment\nanalysis model. Multiple system design setups were experimented with and\nreported. SAIDS was applied to the ArSarcasm-v2 dataset where it outperforms\nthe state-of-the-art model for the sentiment analysis task. By training all\ntasks together, SAIDS achieves results of 75.98 FPN, 59.09 F1-score and 71.13\nF1-score for sentiment analysis, sarcasm detection, and dialect identification\nrespectively. The system design can be used to enhance the performance of any\ntask which is dependent on other tasks.",
        "link": "http://arxiv.org/abs/2301.02521v1",
        "published": "2023-01-06T14:19:46Z",
        "pdf_url": "http://arxiv.org/pdf/2301.02521v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_37.pdf"
    },
    {
        "title": "USA: Universal Sentiment Analysis Model & Construction of Japanese\n  Sentiment Text Classification and Part of Speech Dataset",
        "abstract": "Sentiment analysis is a pivotal task in the domain of natural language\nprocessing. It encompasses both text-level sentiment polarity classification\nand word-level Part of Speech(POS) sentiment polarity determination. Such\nanalysis challenges models to understand text holistically while also\nextracting nuanced information. With the rise of Large Language Models(LLMs),\nnew avenues for sentiment analysis have opened. This paper proposes enhancing\nperformance by leveraging the Mutual Reinforcement Effect(MRE) between\nindividual words and the overall text. It delves into how word polarity\ninfluences the overarching sentiment of a passage. To support our research, we\nannotated four novel Sentiment Text Classification and Part of Speech(SCPOS)\ndatasets, building upon existing sentiment classification datasets.\nFurthermore, we developed a Universal Sentiment Analysis(USA) model, with a\n7-billion parameter size. Experimental results revealed that our model\nsurpassed the performance of gpt-3.5-turbo across all four datasets,\nunderscoring the significance of MRE in sentiment analysis.",
        "link": "http://arxiv.org/abs/2309.03787v2",
        "published": "2023-09-07T15:35:00Z",
        "pdf_url": "http://arxiv.org/pdf/2309.03787v2",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_38.pdf"
    },
    {
        "title": "NLNDE at SemEval-2023 Task 12: Adaptive Pretraining and Source Language\n  Selection for Low-Resource Multilingual Sentiment Analysis",
        "abstract": "This paper describes our system developed for the SemEval-2023 Task 12\n\"Sentiment Analysis for Low-resource African Languages using Twitter Dataset\".\nSentiment analysis is one of the most widely studied applications in natural\nlanguage processing. However, most prior work still focuses on a small number\nof high-resource languages. Building reliable sentiment analysis systems for\nlow-resource languages remains challenging, due to the limited training data in\nthis task. In this work, we propose to leverage language-adaptive and\ntask-adaptive pretraining on African texts and study transfer learning with\nsource language selection on top of an African language-centric pretrained\nlanguage model. Our key findings are: (1) Adapting the pretrained model to the\ntarget language and task using a small yet relevant corpus improves performance\nremarkably by more than 10 F1 score points. (2) Selecting source languages with\npositive transfer gains during training can avoid harmful interference from\ndissimilar languages, leading to better results in multilingual and\ncross-lingual settings. In the shared task, our system wins 8 out of 15 tracks\nand, in particular, performs best in the multilingual evaluation.",
        "link": "http://arxiv.org/abs/2305.00090v1",
        "published": "2023-04-28T21:02:58Z",
        "pdf_url": "http://arxiv.org/pdf/2305.00090v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_39.pdf"
    },
    {
        "title": "Instruct-FinGPT: Financial Sentiment Analysis by Instruction Tuning of\n  General-Purpose Large Language Models",
        "abstract": "Sentiment analysis is a vital tool for uncovering insights from financial\narticles, news, and social media, shaping our understanding of market\nmovements. Despite the impressive capabilities of large language models (LLMs)\nin financial natural language processing (NLP), they still struggle with\naccurately interpreting numerical values and grasping financial context,\nlimiting their effectiveness in predicting financial sentiment. In this paper,\nwe introduce a simple yet effective instruction tuning approach to address\nthese issues. By transforming a small portion of supervised financial sentiment\nanalysis data into instruction data and fine-tuning a general-purpose LLM with\nthis method, we achieve remarkable advancements in financial sentiment\nanalysis. In the experiment, our approach outperforms state-of-the-art\nsupervised sentiment analysis models, as well as widely used LLMs like ChatGPT\nand LLaMAs, particularly in scenarios where numerical understanding and\ncontextual comprehension are vital.",
        "link": "http://arxiv.org/abs/2306.12659v1",
        "published": "2023-06-22T03:56:38Z",
        "pdf_url": "http://arxiv.org/pdf/2306.12659v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_40.pdf"
    },
    {
        "title": "Classifying COVID-19 Related Tweets for Fake News Detection and\n  Sentiment Analysis with BERT-based Models",
        "abstract": "The present paper is about the participation of our team \"techno\" on\nCERIST'22 shared tasks. We used an available dataset \"task1.c\" related to\ncovid-19 pandemic. It comprises 4128 tweets for sentiment analysis task and\n8661 tweets for fake news detection task. We used natural language processing\ntools with the combination of the most renowned pre-trained language models\nBERT (Bidirectional Encoder Representations from Transformers). The results\nshows the efficacy of pre-trained language models as we attained an accuracy of\n0.93 for the sentiment analysis task and 0.90 for the fake news detection task.",
        "link": "http://arxiv.org/abs/2304.00636v1",
        "published": "2023-04-02T22:00:27Z",
        "pdf_url": "http://arxiv.org/pdf/2304.00636v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_41.pdf"
    },
    {
        "title": "Natural Language Processing Through Transfer Learning: A Case Study on\n  Sentiment Analysis",
        "abstract": "Artificial intelligence and machine learning have significantly bolstered the\ntechnological world. This paper explores the potential of transfer learning in\nnatural language processing focusing mainly on sentiment analysis. The models\ntrained on the big data can also be used where data are scarce. The claim is\nthat, compared to training models from scratch, transfer learning, using\npre-trained BERT models, can increase sentiment classification accuracy. The\nstudy adopts a sophisticated experimental design that uses the IMDb dataset of\nsentimentally labelled movie reviews. Pre-processing includes tokenization and\nencoding of text data, making it suitable for NLP models. The dataset is used\non a BERT based model, measuring its performance using accuracy. The result\ncomes out to be 100 per cent accurate. Although the complete accuracy could\nappear impressive, it might be the result of overfitting or a lack of\ngeneralization. Further analysis is required to ensure the model's ability to\nhandle diverse and unseen data. The findings underscore the effectiveness of\ntransfer learning in NLP, showcasing its potential to excel in sentiment\nanalysis tasks. However, the research calls for a cautious interpretation of\nperfect accuracy and emphasizes the need for additional measures to validate\nthe model's generalization.",
        "link": "http://arxiv.org/abs/2311.16965v1",
        "published": "2023-11-28T17:12:06Z",
        "pdf_url": "http://arxiv.org/pdf/2311.16965v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_42.pdf"
    },
    {
        "title": "yosm: A new yoruba sentiment corpus for movie reviews",
        "abstract": "A movie that is thoroughly enjoyed and recommended by an individual might be\nhated by another. One characteristic of humans is the ability to have feelings\nwhich could be positive or negative. To automatically classify and study human\nfeelings, an aspect of natural language processing, sentiment analysis and\nopinion mining were designed to understand human feelings regarding several\nissues which could affect a product, a social media platforms, government, or\nsocietal discussions or even movies. Several works on sentiment analysis have\nbeen done on high resource languages while low resources languages like Yoruba\nhave been sidelined. Due to the scarcity of datasets and linguistic\narchitectures that will suit low resource languages, African languages \"low\nresource languages\" have been ignored and not fully explored. For this reason,\nour attention is placed on Yoruba to explore sentiment analysis on reviews of\nNigerian movies. The data comprised 1500 movie reviews that were sourced from\nIMDB, Rotten Tomatoes, Letterboxd, Cinemapointer and Nollyrated. We develop\nsentiment classification models using the state-of-the-art pre-trained language\nmodels like mBERT and AfriBERTa to classify the movie reviews.",
        "link": "http://arxiv.org/abs/2204.09711v1",
        "published": "2022-04-20T18:00:37Z",
        "pdf_url": "http://arxiv.org/pdf/2204.09711v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_43.pdf"
    },
    {
        "title": "Grammar Detection for Sentiment Analysis through Improved Viterbi\n  Algorithm",
        "abstract": "Grammar Detection, also referred to as Parts of Speech Tagging of raw text,\nis considered an underlying building block of the various Natural Language\nProcessing pipelines like named entity recognition, question answering, and\nsentiment analysis. In short, forgiven a sentence, Parts of Speech tagging is\nthe task of specifying and tagging each word of a sentence with nouns, verbs,\nadjectives, adverbs, and more. Sentiment Analysis may well be a procedure\naccustomed to determining if a given sentence's emotional tone is neutral,\npositive or negative. To assign polarity scores to the thesis or entities\nwithin phrase, in-text analysis and analytics, machine learning and natural\nlanguage processing, approaches are incorporated. This Sentiment Analysis using\nPOS tagger helps us urge a summary of the broader public over a specific topic.\nFor this, we are using the Viterbi algorithm, Hidden Markov Model, Constraint\nbased Viterbi algorithm for POS tagging. By comparing the accuracies, we select\nthe foremost accurate result of the model for Sentiment Analysis for\ndetermining the character of the sentence.",
        "link": "http://arxiv.org/abs/2205.13148v2",
        "published": "2022-05-26T04:40:31Z",
        "pdf_url": "http://arxiv.org/pdf/2205.13148v2",
        "pdf_path": null
    },
    {
        "title": "Thread review sentimental analysis with tkinter GUI & tableau dashboard",
        "abstract": "This project focuses on utilizing a combination of Tkinter for GUI\ndevelopment and Tableauf for data visualization to do sentiment analysis on\nthread reviews.The main goal is to evaluate and visualize consumer sentiments\nas they are expressed in thread reviews in order to provide insights into areas\nfor improvement, preferences, and customer satisfaction.The procedure starts\nwith gathering thread reviews from many sources, which are then cleaned and\nprepared for analysis through preprocessing.Sentiment analysis classifies\nopinions as good, negative, or neutral based on the expressed sentiment by\napplying natural language processing techniques.The standard Python GUI package\nTkinter is used to create an interactive user interface that allows users to\nenter thread reviews, start the sentiment analysis process, and see the\nanalysis's outcomes.With the help of the user-friendly GUI, users may interact\nwith the system and acquire insightful information with ease.Additionally,\nTableau is used to produce a dynamic and eye-catching dashboard that displays\nthe findings of the sentiment analysis using a variety of charts and\ngraphs.Stakeholders may make educated decisions based on the studied data by\nusing the dashboard, which provides a thorough overview of the sentiment\ndistribution, frequency of positive and negative reviews, trending topics, and\nother pertinent indicators.Overall, this project offers a solid method for\nanalyzing and comprehending customers' sentiments from thread reviews by\nintegrating Tableauf for GUI development with Tkinter for sentiment analysis\nand data visualization. This allows for the creation of meaningful dashboards.",
        "link": "http://arxiv.org/abs/2405.00377v1",
        "published": "2024-05-01T08:09:04Z",
        "pdf_url": "http://arxiv.org/pdf/2405.00377v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_45.pdf"
    },
    {
        "title": "Sentiment Analysis Challenges in Persian Language",
        "abstract": "The rapid growth in data on the internet requires a data mining process to\nreach a decision to support insight. The Persian language has strong potential\nfor deep research in any aspect of natural language processing, especially\nsentimental analysis approach. Thousands of websites and blogs updates and\nmodifies by Persian users around the world that contains millions of Persian\ncontext. This range of application requires a comprehensive structured\nframework to extract beneficial information for helping enterprises to enhance\ntheir business and initiate a customer-centric management process by producing\neffective recommender systems. Sentimental analysis is an intelligent approach\nfor extracting useful information from huge amounts of data to help an\nenterprise for smart management process. In this road, machine learning and\ndeep learning techniques will become very helpful but there is the number of\nchallenges which are face to them. This paper tried to present and assert the\nmost important challenges of sentimental analysis in the Persian language. This\nlanguage is an Indo-European language which spoken by over 110 million people\naround the world and is an official language in Iran, Tajikistan, and\nAfghanistan. Its also widely used in Uzbekistan, Pakistan and Turkish by order.",
        "link": "http://arxiv.org/abs/1907.04407v2",
        "published": "2019-07-09T20:46:37Z",
        "pdf_url": "http://arxiv.org/pdf/1907.04407v2",
        "pdf_path": null
    },
    {
        "title": "Improving Sentiment Analysis in Arabic Using Word Representation",
        "abstract": "The complexities of Arabic language in morphology, orthography and dialects\nmakes sentiment analysis for Arabic more challenging. Also, text feature\nextraction from short messages like tweets, in order to gauge the sentiment,\nmakes this task even more difficult. In recent years, deep neural networks were\noften employed and showed very good results in sentiment classification and\nnatural language processing applications. Word embedding, or word distributing\napproach, is a current and powerful tool to capture together the closest words\nfrom a contextual text. In this paper, we describe how we construct Word2Vec\nmodels from a large Arabic corpus obtained from ten newspapers in different\nArab countries. By applying different machine learning algorithms and\nconvolutional neural networks with different text feature selections, we report\nimproved accuracy of sentiment classification (91%-95%) on our publicly\navailable Arabic language health sentiment dataset [1]",
        "link": "http://arxiv.org/abs/1803.00124v2",
        "published": "2018-02-28T22:46:19Z",
        "pdf_url": "http://arxiv.org/pdf/1803.00124v2",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_47.pdf"
    },
    {
        "title": "Improving the Accuracy of Pre-trained Word Embeddings for Sentiment\n  Analysis",
        "abstract": "Sentiment analysis is one of the well-known tasks and fast growing research\nareas in natural language processing (NLP) and text classifications. This\ntechnique has become an essential part of a wide range of applications\nincluding politics, business, advertising and marketing. There are various\ntechniques for sentiment analysis, but recently word embeddings methods have\nbeen widely used in sentiment classification tasks. Word2Vec and GloVe are\ncurrently among the most accurate and usable word embedding methods which can\nconvert words into meaningful vectors. However, these methods ignore sentiment\ninformation of texts and need a huge corpus of texts for training and\ngenerating exact vectors which are used as inputs of deep learning models. As a\nresult, because of the small size of some corpuses, researcher often have to\nuse pre-trained word embeddings which were trained on other large text corpus\nsuch as Google News with about 100 billion words. The increasing accuracy of\npre-trained word embeddings has a great impact on sentiment analysis research.\nIn this paper we propose a novel method, Improved Word Vectors (IWV), which\nincreases the accuracy of pre-trained word embeddings in sentiment analysis.\nOur method is based on Part-of-Speech (POS) tagging techniques, lexicon-based\napproaches and Word2Vec/GloVe methods. We tested the accuracy of our method via\ndifferent deep learning models and sentiment datasets. Our experiment results\nshow that Improved Word Vectors (IWV) are very effective for sentiment\nanalysis.",
        "link": "http://arxiv.org/abs/1711.08609v1",
        "published": "2017-11-23T08:25:23Z",
        "pdf_url": "http://arxiv.org/pdf/1711.08609v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_48.pdf"
    },
    {
        "title": "Sentiment Analysis of Code-Mixed Languages leveraging Resource Rich\n  Languages",
        "abstract": "Code-mixed data is an important challenge of natural language processing\nbecause its characteristics completely vary from the traditional structures of\nstandard languages.\n  In this paper, we propose a novel approach called Sentiment Analysis of\nCode-Mixed Text (SACMT) to classify sentences into their corresponding\nsentiment - positive, negative or neutral, using contrastive learning. We\nutilize the shared parameters of siamese networks to map the sentences of\ncode-mixed and standard languages to a common sentiment space. Also, we\nintroduce a basic clustering based preprocessing method to capture variations\nof code-mixed transliterated words. Our experiments reveal that SACMT\noutperforms the state-of-the-art approaches in sentiment analysis for\ncode-mixed text by 7.6% in accuracy and 10.1% in F-score.",
        "link": "http://arxiv.org/abs/1804.00806v1",
        "published": "2018-04-03T03:19:41Z",
        "pdf_url": "http://arxiv.org/pdf/1804.00806v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_49.pdf"
    },
    {
        "title": "Creating emoji lexica from unsupervised sentiment analysis of their\n  descriptions",
        "abstract": "Online media, such as blogs and social networking sites, generate massive\nvolumes of unstructured data of great interest to analyze the opinions and\nsentiments of individuals and organizations. Novel approaches beyond Natural\nLanguage Processing are necessary to quantify these opinions with polarity\nmetrics. So far, the sentiment expressed by emojis has received little\nattention. The use of symbols, however, has boomed in the past four years.\nAbout twenty billion are typed in Twitter nowadays, and new emojis keep\nappearing in each new Unicode version, making them increasingly relevant to\nsentiment analysis tasks. This has motivated us to propose a novel approach to\npredict the sentiments expressed by emojis in online textual messages, such as\ntweets, that does not require human effort to manually annotate data and saves\nvaluable time for other analysis tasks. For this purpose, we automatically\nconstructed a novel emoji sentiment lexicon using an unsupervised sentiment\nanalysis system based on the definitions given by emoji creators in Emojipedia.\nAdditionally, we automatically created lexicon variants by also considering the\nsentiment distribution of the informal texts accompanying emojis. All these\nlexica are evaluated and compared regarding the improvement obtained by\nincluding them in sentiment analysis of the annotated datasets provided by\nKralj Novak et al. (2015). The results confirm the competitiveness of our\napproach.",
        "link": "http://arxiv.org/abs/2404.01439v1",
        "published": "2024-04-01T19:22:58Z",
        "pdf_url": "http://arxiv.org/pdf/2404.01439v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_50.pdf"
    },
    {
        "title": "Using objective words in the reviews to improve the colloquial arabic\n  sentiment analysis",
        "abstract": "One of the main difficulties in sentiment analysis of the Arabic language is\nthe presence of the colloquialism. In this paper, we examine the effect of\nusing objective words in conjunction with sentimental words on sentiment\nclassification for the colloquial Arabic reviews, specifically Jordanian\ncolloquial reviews. The reviews often include both sentimental and objective\nwords, however, the most existing sentiment analysis models ignore the\nobjective words as they are considered useless. In this work, we created two\nlexicons: the first includes the colloquial sentimental words and compound\nphrases, while the other contains the objective words associated with values of\nsentiment tendency based on a particular estimation method. We used these\nlexicons to extract sentiment features that would be training input to the\nSupport Vector Machines (SVM) to classify the sentiment polarity of the\nreviews. The reviews dataset have been collected manually from JEERAN website.\nThe results of the experiments show that the proposed approach improves the\npolarity classification in comparison to two baseline models, with accuracy\n95.6%.",
        "link": "http://arxiv.org/abs/1709.08521v1",
        "published": "2017-09-25T14:40:28Z",
        "pdf_url": "http://arxiv.org/pdf/1709.08521v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_51.pdf"
    },
    {
        "title": "Persian Sentiment Analyzer: A Framework based on a Novel Feature\n  Selection Method",
        "abstract": "In the recent decade, with the enormous growth of digital content in internet\nand databases, sentiment analysis has received more and more attention between\ninformation retrieval and natural language processing researchers. Sentiment\nanalysis aims to use automated tools to detect subjective information from\nreviews. One of the main challenges in sentiment analysis is feature selection.\nFeature selection is widely used as the first stage of analysis and\nclassification tasks to reduce the dimension of problem, and improve speed by\nthe elimination of irrelevant and redundant features. Up to now as there are\nfew researches conducted on feature selection in sentiment analysis, there are\nvery rare works for Persian sentiment analysis. This paper considers the\nproblem of sentiment classification using different feature selection methods\nfor online customer reviews in Persian language. Three of the challenges of\nPersian text are using of a wide variety of declensional suffixes, different\nword spacing and many informal or colloquial words. In this paper we study\nthese challenges by proposing a model for sentiment classification of Persian\nreview documents. The proposed model is based on lemmatization and feature\nselection and is employed Naive Bayes algorithm for classification. We evaluate\nthe performance of the model on a manually gathered collection of cellphone\nreviews, where the results show the effectiveness of the proposed approaches.",
        "link": "http://arxiv.org/abs/1412.8079v1",
        "published": "2014-12-27T21:00:24Z",
        "pdf_url": "http://arxiv.org/pdf/1412.8079v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_52.pdf"
    },
    {
        "title": "JU_KS@SAIL_CodeMixed-2017: Sentiment Analysis for Indian Code Mixed\n  Social Media Texts",
        "abstract": "This paper reports about our work in the NLP Tool Contest @ICON-2017, shared\ntask on Sentiment Analysis for Indian Languages (SAIL) (code mixed). To\nimplement our system, we have used a machine learning algo-rithm called\nMultinomial Na\\\"ive Bayes trained using n-gram and SentiWordnet features. We\nhave also used a small SentiWordnet for English and a small SentiWordnet for\nBengali. But we have not used any SentiWordnet for Hindi language. We have\ntested our system on Hindi-English and Bengali-English code mixed social media\ndata sets released for the contest. The performance of our system is very close\nto the best system participated in the contest. For both Bengali-English and\nHindi-English runs, our system was ranked at the 3rd position out of all\nsubmitted runs and awarded the 3rd prize in the contest.",
        "link": "http://arxiv.org/abs/1802.05737v1",
        "published": "2018-02-15T20:02:43Z",
        "pdf_url": "http://arxiv.org/pdf/1802.05737v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_53.pdf"
    },
    {
        "title": "Leveraging Pre-trained Language Model for Speech Sentiment Analysis",
        "abstract": "In this paper, we explore the use of pre-trained language models to learn\nsentiment information of written texts for speech sentiment analysis. First, we\ninvestigate how useful a pre-trained language model would be in a 2-step\npipeline approach employing Automatic Speech Recognition (ASR) and\ntranscripts-based sentiment analysis separately. Second, we propose a pseudo\nlabel-based semi-supervised training strategy using a language model on an\nend-to-end speech sentiment approach to take advantage of a large, but\nunlabeled speech dataset for training. Although spoken and written texts have\ndifferent linguistic characteristics, they can complement each other in\nunderstanding sentiment. Therefore, the proposed system can not only model\nacoustic characteristics to bear sentiment-specific information in speech\nsignals, but learn latent information to carry sentiments in the text\nrepresentation. In these experiments, we demonstrate the proposed approaches\nimprove F1 scores consistently compared to systems without a language model.\nMoreover, we also show that the proposed framework can reduce 65% of human\nsupervision by leveraging a large amount of data without human sentiment\nannotation and boost performance in a low-resource condition where the human\nsentiment annotation is not available enough.",
        "link": "http://arxiv.org/abs/2106.06598v1",
        "published": "2021-06-11T20:15:21Z",
        "pdf_url": "http://arxiv.org/pdf/2106.06598v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_54.pdf"
    },
    {
        "title": "Dancing in the syntax forest: fast, accurate and explainable sentiment\n  analysis with SALSA",
        "abstract": "Sentiment analysis is a key technology for companies and institutions to\ngauge public opinion on products, services or events. However, for large-scale\nsentiment analysis to be accessible to entities with modest computational\nresources, it needs to be performed in a resource-efficient way. While some\nefficient sentiment analysis systems exist, they tend to apply shallow\nheuristics, which do not take into account syntactic phenomena that can\nradically change sentiment. Conversely, alternatives that take syntax into\naccount are computationally expensive. The SALSA project, funded by the\nEuropean Research Council under a Proof-of-Concept Grant, aims to leverage\nrecently-developed fast syntactic parsing techniques to build sentiment\nanalysis systems that are lightweight and efficient, while still providing\naccuracy and explainability through the explicit use of syntax. We intend our\napproaches to be the backbone of a working product of interest for SMEs to use\nin production.",
        "link": "http://arxiv.org/abs/2406.16071v1",
        "published": "2024-06-23T10:47:01Z",
        "pdf_url": "http://arxiv.org/pdf/2406.16071v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_55.pdf"
    },
    {
        "title": "Dialog speech sentiment classification for imbalanced datasets",
        "abstract": "Speech is the most common way humans express their feelings, and sentiment\nanalysis is the use of tools such as natural language processing and\ncomputational algorithms to identify the polarity of these feelings. Even\nthough this field has seen tremendous advancements in the last two decades, the\ntask of effectively detecting under represented sentiments in different kinds\nof datasets is still a challenging task. In this paper, we use single and\nbi-modal analysis of short dialog utterances and gain insights on the main\nfactors that aid in sentiment detection, particularly in the underrepresented\nclasses, in datasets with and without inherent sentiment component.\nFurthermore, we propose an architecture which uses a learning rate scheduler\nand different monitoring criteria and provides state-of-the-art results for the\nSWITCHBOARD imbalanced sentiment dataset.",
        "link": "http://arxiv.org/abs/2109.07228v1",
        "published": "2021-09-15T11:43:04Z",
        "pdf_url": "http://arxiv.org/pdf/2109.07228v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_56.pdf"
    },
    {
        "title": "Analyst Reports and Stock Performance: Evidence from the Chinese Market",
        "abstract": "This article applies natural language processing (NLP) to extract and\nquantify textual information to predict stock performance. Using an extensive\ndataset of Chinese analyst reports and employing a customized BERT deep\nlearning model for Chinese text, this study categorizes the sentiment of the\nreports as positive, neutral, or negative. The findings underscore the\npredictive capacity of this sentiment indicator for stock volatility, excess\nreturns, and trading volume. Specifically, analyst reports with strong positive\nsentiment will increase excess return and intraday volatility, and vice versa,\nreports with strong negative sentiment also increase volatility and trading\nvolume, but decrease future excess return. The magnitude of this effect is\ngreater for positive sentiment reports than for negative sentiment reports.\nThis article contributes to the empirical literature on sentiment analysis and\nthe response of the stock market to news in the Chinese stock market.",
        "link": "http://arxiv.org/abs/2411.08726v2",
        "published": "2024-11-13T16:08:40Z",
        "pdf_url": "http://arxiv.org/pdf/2411.08726v2",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_57.pdf"
    },
    {
        "title": "Sentiment analysis of texts from social networks based on machine\n  learning methods for monitoring public sentiment",
        "abstract": "A sentiment analysis system powered by machine learning was created in this\nstudy to improve real-time social network public opinion monitoring. For\nsophisticated sentiment identification, the suggested approach combines\ncutting-edge transformer-based architectures (DistilBERT, RoBERTa) with\ntraditional machine learning models (Logistic Regression, SVM, Naive Bayes).\nThe system achieved an accuracy of up to 80-85% using transformer models in\nreal-world scenarios after being tested using both deep learning techniques and\nstandard machine learning processes on annotated social media datasets.\nAccording to experimental results, deep learning models perform noticeably\nbetter than lexicon-based and conventional rule-based classifiers, lowering\nmisclassification rates and enhancing the ability to recognize nuances like\nsarcasm. According to feature importance analysis, context tokens,\nsentiment-bearing keywords, and part-of-speech structure are essential for\nprecise categorization. The findings confirm that AI-driven sentiment\nframeworks can provide a more adaptive and efficient approach to modern\nsentiment challenges. Despite the system's impressive performance, issues with\ncomputing overhead, data quality, and domain-specific terminology still exist.\nIn order to monitor opinions on a broad scale, future research will investigate\nimproving computing performance, extending coverage to various languages, and\nintegrating real-time streaming APIs. The results demonstrate that governments,\ncorporations, and social researchers looking for more in-depth understanding of\npublic mood on digital platforms can find a reliable and adaptable answer in\nAI-powered sentiment analysis.",
        "link": "http://arxiv.org/abs/2502.17143v1",
        "published": "2025-02-24T13:34:35Z",
        "pdf_url": "http://arxiv.org/pdf/2502.17143v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_58.pdf"
    },
    {
        "title": "Applying BERT and ChatGPT for Sentiment Analysis of Lyme Disease in\n  Scientific Literature",
        "abstract": "This chapter presents a practical guide for conducting Sentiment Analysis\nusing Natural Language Processing (NLP) techniques in the domain of tick-borne\ndisease text. The aim is to demonstrate the process of how the presence of bias\nin the discourse surrounding chronic manifestations of the disease can be\nevaluated. The goal is to use a dataset of 5643 abstracts collected from\nscientific journals on the topic of chronic Lyme disease to demonstrate using\nPython, the steps for conducting sentiment analysis using pre-trained language\nmodels and the process of validating the preliminary results using both\ninterpretable machine learning tools, as well as a novel methodology of using\nemerging state-of-the-art large language models like ChatGPT. This serves as a\nuseful resource for researchers and practitioners interested in using NLP\ntechniques for sentiment analysis in the medical domain.",
        "link": "http://arxiv.org/abs/2302.06474v1",
        "published": "2023-02-07T01:15:05Z",
        "pdf_url": "http://arxiv.org/pdf/2302.06474v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_59.pdf"
    },
    {
        "title": "Enhanced Sentiment Analysis of Iranian Restaurant Reviews Utilizing\n  Sentiment Intensity Analyzer & Fuzzy Logic",
        "abstract": "This research presents an advanced sentiment analysis framework studied on\nIranian restaurant reviews, combining fuzzy logic with conventional sentiment\nanalysis techniques to assess both sentiment polarity and intensity. A dataset\nof 1266 reviews, alongside corresponding star ratings, was compiled and\npreprocessed for analysis. Initial sentiment analysis was conducted using the\nSentiment Intensity Analyzer (VADER), a rule-based tool that assigns sentiment\nscores across positive, negative, and neutral categories. However, a noticeable\nbias toward neutrality often led to an inaccurate representation of sentiment\nintensity. To mitigate this issue, based on a fuzzy perspective, two refinement\ntechniques were introduced, applying square-root and fourth-root\ntransformations to amplify positive and negative sentiment scores while\nmaintaining neutrality. This led to three distinct methodologies: Approach 1,\nutilizing unaltered VADER scores; Approach 2, modifying sentiment values using\nthe square root; and Approach 3, applying the fourth root for further\nrefinement. A Fuzzy Inference System incorporating comprehensive fuzzy rules\nwas then developed to process these refined scores and generate a single,\ncontinuous sentiment value for each review based on each approach. Comparative\nanalysis, including human supervision and alignment with customer star ratings,\nrevealed that the refined approaches significantly improved sentiment analysis\nby reducing neutrality bias and better capturing sentiment intensity. Despite\nthese advancements, minor over-amplification and persistent neutrality in\ndomain-specific cases were identified, leading us to propose several future\nstudies to tackle these occasional barriers. The study's methodology and\noutcomes offer valuable insights for businesses seeking a more precise\nunderstanding of consumer sentiment, enhancing sentiment analysis across\nvarious industries.",
        "link": "http://arxiv.org/abs/2503.12141v1",
        "published": "2025-03-15T13:55:23Z",
        "pdf_url": "http://arxiv.org/pdf/2503.12141v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_60.pdf"
    },
    {
        "title": "Fine-grained Sentiment Classification using BERT",
        "abstract": "Sentiment classification is an important process in understanding people's\nperception towards a product, service, or topic. Many natural language\nprocessing models have been proposed to solve the sentiment classification\nproblem. However, most of them have focused on binary sentiment classification.\nIn this paper, we use a promising deep learning model called BERT to solve the\nfine-grained sentiment classification task. Experiments show that our model\noutperforms other popular models for this task without sophisticated\narchitecture. We also demonstrate the effectiveness of transfer learning in\nnatural language processing in the process.",
        "link": "http://arxiv.org/abs/1910.03474v1",
        "published": "2019-10-04T09:20:48Z",
        "pdf_url": "http://arxiv.org/pdf/1910.03474v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_61.pdf"
    },
    {
        "title": "AlbMoRe: A Corpus of Movie Reviews for Sentiment Analysis in Albanian",
        "abstract": "Lack of available resources such as text corpora for low-resource languages\nseriously hinders research on natural language processing and computational\nlinguistics. This paper presents AlbMoRe, a corpus of 800 sentiment annotated\nmovie reviews in Albanian. Each text is labeled as positive or negative and can\nbe used for sentiment analysis research. Preliminary results based on\ntraditional machine learning classifiers trained with the AlbMoRe samples are\nalso reported. They can serve as comparison baselines for future research\nexperiments.",
        "link": "http://arxiv.org/abs/2306.08526v1",
        "published": "2023-06-14T14:21:55Z",
        "pdf_url": "http://arxiv.org/pdf/2306.08526v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_62.pdf"
    },
    {
        "title": "M2SA: Multimodal and Multilingual Model for Sentiment Analysis of Tweets",
        "abstract": "In recent years, multimodal natural language processing, aimed at learning\nfrom diverse data types, has garnered significant attention. However, there\nneeds to be more clarity when it comes to analysing multimodal tasks in\nmulti-lingual contexts. While prior studies on sentiment analysis of tweets\nhave predominantly focused on the English language, this paper addresses this\ngap by transforming an existing textual Twitter sentiment dataset into a\nmultimodal format through a straightforward curation process. Our work opens up\nnew avenues for sentiment-related research within the research community.\nAdditionally, we conduct baseline experiments utilising this augmented dataset\nand report the findings. Notably, our evaluations reveal that when comparing\nunimodal and multimodal configurations, using a sentiment-tuned large language\nmodel as a text encoder performs exceptionally well.",
        "link": "http://arxiv.org/abs/2404.01753v3",
        "published": "2024-04-02T09:11:58Z",
        "pdf_url": "http://arxiv.org/pdf/2404.01753v3",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_63.pdf"
    },
    {
        "title": "A multiclass Q-NLP sentiment analysis experiment using DisCoCat",
        "abstract": "Sentiment analysis is a branch of Natural Language Processing (NLP) which\ngoal is to assign sentiments or emotions to particular sentences or words.\nPerforming this task is particularly useful for companies wishing to take into\naccount customer feedback through chatbots or verbatim. This has been done\nextensively in the literature using various approaches, ranging from simple\nmodels to deep transformer neural networks. In this paper, we will tackle\nsentiment analysis in the Noisy Intermediate Scale Computing (NISQ) era, using\nthe DisCoCat model of language. We will first present the basics of quantum\ncomputing and the DisCoCat model. This will enable us to define a general\nframework to perform NLP tasks on a quantum computer. We will then extend the\ntwo-class classification that was performed by Lorenz et al. (2021) to a\nfour-class sentiment analysis experiment on a much larger dataset, showing the\nscalability of such a framework.",
        "link": "http://arxiv.org/abs/2209.03152v1",
        "published": "2022-09-07T13:47:35Z",
        "pdf_url": "http://arxiv.org/pdf/2209.03152v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_64.pdf"
    },
    {
        "title": "Transformer-Encoder-GRU (T-E-GRU) for Chinese Sentiment Analysis on\n  Chinese Comment Text",
        "abstract": "Chinese sentiment analysis (CSA) has always been one of the challenges in\nnatural language processing due to its complexity and uncertainty. Transformer\nhas succeeded in capturing semantic features, but it uses position encoding to\ncapture sequence features, which has great shortcomings compared with the\nrecurrent model. In this paper, we propose T-E-GRU for Chinese sentiment\nanalysis, which combine transformer encoder and GRU. We conducted experiments\non three Chinese comment datasets. In view of the confusion of punctuation\nmarks in Chinese comment texts, we selectively retain some punctuation marks\nwith sentence segmentation ability. The experimental results show that T-E-GRU\noutperforms classic recurrent model and recurrent model with attention.",
        "link": "http://arxiv.org/abs/2108.00400v1",
        "published": "2021-08-01T08:42:26Z",
        "pdf_url": "http://arxiv.org/pdf/2108.00400v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_65.pdf"
    },
    {
        "title": "Implicit Sentiment Analysis Based on Chain of Thought Prompting",
        "abstract": "Implicit Sentiment Analysis (ISA) is a crucial research area in natural\nlanguage processing. Inspired by the idea of large language model Chain of\nThought (CoT), this paper introduces a Sentiment Analysis of Thinking (SAoT)\nframework. The framework first analyzes the implicit aspects and opinions in\nthe text using common sense and thinking chain capabilities. Then, it reflects\non the process of implicit sentiment analysis and finally deduces the polarity\nof sentiment. The model is evaluated on the SemEval 2014 dataset, consisting of\n1120 restaurant reviews and 638 laptop reviews. The experimental results\ndemonstrate that the utilization of the ERNIE-Bot-4+SAoT model yields a notable\nperformance improvement. Specifically, on the restaurant dataset, the F1 score\nreaches 75.27, accompanied by an ISA score of 66.29. Similarly, on the computer\ndataset, the F1 score achieves 76.50, while the ISA score amounts to 73.46.\nComparatively, the ERNIE-Bot-4+SAoT model surpasses the BERTAsp + SCAPt\nbaseline by an average margin of 47.99%.",
        "link": "http://arxiv.org/abs/2408.12157v1",
        "published": "2024-08-22T06:55:29Z",
        "pdf_url": "http://arxiv.org/pdf/2408.12157v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_66.pdf"
    },
    {
        "title": "Investigating the Impact of Language-Adaptive Fine-Tuning on Sentiment\n  Analysis in Hausa Language Using AfriBERTa",
        "abstract": "Sentiment analysis (SA) plays a vital role in Natural Language Processing\n(NLP) by ~identifying sentiments expressed in text. Although significant\nadvances have been made in SA for widely spoken languages, low-resource\nlanguages such as Hausa face unique challenges, primarily due to a lack of\ndigital resources. This study investigates the effectiveness of\nLanguage-Adaptive Fine-Tuning (LAFT) to improve SA performance in Hausa. We\nfirst curate a diverse, unlabeled corpus to expand the model's linguistic\ncapabilities, followed by applying LAFT to adapt AfriBERTa specifically to the\nnuances of the Hausa language. The adapted model is then fine-tuned on the\nlabeled NaijaSenti sentiment dataset to evaluate its performance. Our findings\ndemonstrate that LAFT gives modest improvements, which may be attributed to the\nuse of formal Hausa text rather than informal social media data. Nevertheless,\nthe pre-trained AfriBERTa model significantly outperformed models not\nspecifically trained on Hausa, highlighting the importance of using pre-trained\nmodels in low-resource contexts. This research emphasizes the necessity for\ndiverse data sources to advance NLP applications for low-resource African\nlanguages. We published the code and the dataset to encourage further research\nand facilitate reproducibility in low-resource NLP here:\nhttps://github.com/Sani-Abdullahi-Sani/Natural-Language-Processing/blob/main/Sentiment%20Analysis%20for%20Low%20Resource%20African%20Languages",
        "link": "http://arxiv.org/abs/2501.11023v1",
        "published": "2025-01-19T11:52:46Z",
        "pdf_url": "http://arxiv.org/pdf/2501.11023v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_67.pdf"
    },
    {
        "title": "Geo-located Aspect Based Sentiment Analysis (ABSA) for Crowdsourced\n  Evaluation of Urban Environments",
        "abstract": "Sentiment analysis methods are rapidly being adopted by the field of Urban\nDesign and Planning, for the crowdsourced evaluation of urban environments.\nHowever, most models used within this domain are able to identify positive or\nnegative sentiment associated with a textual appraisal as a whole, without\ninferring information about specific urban aspects contained within it, or the\nsentiment associated with them. While Aspect Based Sentiment Analysis (ABSA) is\nbecoming increasingly popular, most existing ABSA models are trained on\nnon-urban themes such as restaurants, electronics, consumer goods and the like.\nThis body of research develops an ABSA model capable of extracting urban\naspects contained within geo-located textual urban appraisals, along with\ncorresponding aspect sentiment classification. We annotate a dataset of 2500\ncrowdsourced reviews of public parks, and train a Bidirectional Encoder\nRepresentations from Transformers (BERT) model with Local Context Focus (LCF)\non this data. Our model achieves significant improvement in prediction accuracy\non urban reviews, for both Aspect Term Extraction (ATE) and Aspect Sentiment\nClassification (ASC) tasks. For demonstrative analysis, positive and negative\nurban aspects across Boston are spatially visualized. We hope that this model\nis useful for designers and planners for fine-grained urban sentiment\nevaluation.",
        "link": "http://arxiv.org/abs/2312.12253v1",
        "published": "2023-12-19T15:37:27Z",
        "pdf_url": "http://arxiv.org/pdf/2312.12253v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_68.pdf"
    },
    {
        "title": "Large Language Models Meet Text-Centric Multimodal Sentiment Analysis: A\n  Survey",
        "abstract": "Compared to traditional sentiment analysis, which only considers text,\nmultimodal sentiment analysis needs to consider emotional signals from\nmultimodal sources simultaneously and is therefore more consistent with the way\nhow humans process sentiment in real-world scenarios. It involves processing\nemotional information from various sources such as natural language, images,\nvideos, audio, physiological signals, etc. However, although other modalities\nalso contain diverse emotional cues, natural language usually contains richer\ncontextual information and therefore always occupies a crucial position in\nmultimodal sentiment analysis. The emergence of ChatGPT has opened up immense\npotential for applying large language models (LLMs) to text-centric multimodal\ntasks. However, it is still unclear how existing LLMs can adapt better to\ntext-centric multimodal sentiment analysis tasks. This survey aims to (1)\npresent a comprehensive review of recent research in text-centric multimodal\nsentiment analysis tasks, (2) examine the potential of LLMs for text-centric\nmultimodal sentiment analysis, outlining their approaches, advantages, and\nlimitations, (3) summarize the application scenarios of LLM-based multimodal\nsentiment analysis technology, and (4) explore the challenges and potential\nresearch directions for multimodal sentiment analysis in the future.",
        "link": "http://arxiv.org/abs/2406.08068v2",
        "published": "2024-06-12T10:36:27Z",
        "pdf_url": "http://arxiv.org/pdf/2406.08068v2",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_69.pdf"
    },
    {
        "title": "Uzbek Sentiment Analysis based on local Restaurant Reviews",
        "abstract": "Extracting useful information for sentiment analysis and classification\nproblems from a big amount of user-generated feedback, such as restaurant\nreviews, is a crucial task of natural language processing, which is not only\nfor customer satisfaction where it can give personalized services, but can also\ninfluence the further development of a company. In this paper, we present a\nwork done on collecting restaurant reviews data as a sentiment analysis dataset\nfor the Uzbek language, a member of the Turkic family which is heavily affected\nby the low-resource constraint, and provide some further analysis of the novel\ndataset by evaluation using different techniques, from logistic regression\nbased models, to support vector machines, and even deep learning models, such\nas recurrent neural networks, as well as convolutional neural networks. The\npaper includes detailed information on how the data was collected, how it was\npre-processed for better quality optimization, as well as experimental setups\nfor the evaluation process. The overall evaluation results indicate that by\nperforming pre-processing steps, such as stemming for agglutinative languages,\nthe system yields better results, eventually achieving 91% accuracy result in\nthe best performing model",
        "link": "http://arxiv.org/abs/2205.15930v1",
        "published": "2022-05-31T16:21:00Z",
        "pdf_url": "http://arxiv.org/pdf/2205.15930v1",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_70.pdf"
    },
    {
        "title": "Sentiment Analysis Using Natural Language Processing",
        "abstract": "Abstract: In recent years, there has been an increasing interest in using natural language processing (NLP) to perform sentiment analysis. This is because NLP can help to automatically extract and identify the sentiment expressed in text data, which is often more accurate and reliable than using human annotation. There are a variety of NLP techniques that can be used for sentiment analysis, including opinion mining, text classification, and lexical analysis. Each of these methods has its own advantages and disadvantages, and the choice of technique will often depend on the type and quality of the text data that is available. In general, sentiment analysis using NLP is a very promising area of research with many potential applications. As more and more text data is generated, it will become increasingly important to be able to automatically extract the sentiment expressed in this data.",
        "link": "https://www.semanticscholar.org/paper/b1cd8297dc80210207c86435e573ed4cf1a83014",
        "published": "2022",
        "pdf_url": "https://doi.org/10.22214/ijraset.2022.42711",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_71.pdf"
    },
    {
        "title": "Sentiment analysis using natural language processing",
        "abstract": null,
        "link": "https://www.semanticscholar.org/paper/1b9d089d4d6d2cca3c7b8bb6729171504da87f86",
        "published": "2024",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis Using Natural Language Processing",
        "abstract": "In this research, Our initial efforts on text based sentiment detection of tweets are presented in this publication. The\nmotive of this experiment is to extract sentiment from tweets by using subjects that are present in them. Using methods from\nNatural Language Processing(NLP), it determines the sentiment that relevant to the specific topic. The subjective aspect\nclassification, semantic connection, and polarity categorization are the three primary processes in our experiment that are used\nto classify sentiment. By establishing experiment uses sentiment lexical terms to determine the grammatical relationship between\nsubject matter and sentiment lexicons.\nThe suggested approach outperforms the existing text sentiment analysis technologies, according to experimental data, because\ntweets' structure differs from that of conventional text. The categorization of emotions in textual data is known as sentiment\nanalysis, sometimes called opinion mining or emotion extraction. This approach has been widely used over time to pinpoint the\nfeelings and ideas present in a particular textual information set. People mostly use Twitter as a means of social media to\ncommunicate their feelings on specific events. In this study, we gathered tweets for different occurrences, evaluated them using\nseveral automated learning methods, including LSTM, the Random Forest classifier, SVM, and Naïve Bays, and compared the\noutcomes.",
        "link": "https://www.semanticscholar.org/paper/024f6f5f2c3dc10d5745c3cd94a0bab184a00e67",
        "published": "2025",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis Using Natural Language Processing",
        "abstract": null,
        "link": "https://www.semanticscholar.org/paper/afb6b12b7a7bb97b38dd8a086319ded886cdc737",
        "published": "2021",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Real-Time Market Sentiment Analysis Using Natural Language Processing and ML",
        "abstract": "Since the world of financial markets is becoming much faster, having to do with ‘present’ data promptly seems impossible and forgetting about unnecessary materials can hardly be done. The paper is aimed to present an innovative real-time market sentiment analysis approach that utilizes NLP and ML with the capture of social, media news source, or financial reports sentiments through a computational algorithm. The methodology is an NLP-based search for sentiment anomalies and uses machine learning algorithms based on historical market data utilized to pattern recognition. By merging these models immediately, it ensures timely changes that stimulate traders and investors to respond with the market when necessary. Finally, the ethical concerns are also considered to ensure there is enough transparency in using sentiment analysis algorithms that rely on automation for financial markets. This non-standard approach aims to transform the sentiments’ dynamics reading and reaction of market players. It offers a good navigational aid through the labyrinth of modern financial market. With the objective of providing accurate information on market feelings, this method tried to utilize both NLP and ML in an integrated approach that enables decision-makers to stay a step ahead of trends by developing reasonable decisions.",
        "link": "https://www.semanticscholar.org/paper/9c547cc32f42f95d437f7486dc6a390f296d73f0",
        "published": "2024",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Political sentiment analysis using natural language processing on social media",
        "abstract": "In this contemporary era , social media has become an essential component of daily life as a result of the extensive use of the internet. This paper explores sentiment analysis of political topics through social media comments. We collected a large dataset of over 14,000 political comments and applied advanced machine learning models such as logistic regression , linear support vector classification , random forest, decision tree classification , and naive bayes to evaluate expressed sentiments. Performance metrics , including accuracy , precision , recall , and F1 scores , were utilized to assess these models , with Linear SVC achieving the highest accuracy at 91.18% , closely followed by Logistic Regression at 90%. This research not only evaluates model performance on political sentiment data but also addresses data imbalance, presenting actionable insights into each algorithm’s suitability. Our study introduces a refined approach to political sentiment analysis by optimizing model selection for high accuracy and robustness, thus setting a foundation for effective political sentiment understanding on social media platforms.\n\n",
        "link": "https://www.semanticscholar.org/paper/f0a5927a6195511ede6464bfcb820916da66f844",
        "published": "2024",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Using Natural Language Processing to Explore Social Media Opinions on Food Security: Sentiment Analysis and Topic Modeling Study",
        "abstract": "Background Social media has the potential to be of great value in understanding patterns in public health using large-scale analysis approaches (eg, data science and natural language processing [NLP]), 2 of which have been used in public health: sentiment analysis and topic modeling; however, their use in the area of food security and public health nutrition is limited. Objective This study aims to explore the potential use of NLP tools to gather insights from real-world social media data on the public health issue of food security. Methods A search strategy for obtaining tweets was developed using food security terms. Tweets were collected using the Twitter application programming interface from January 1, 2019, to December 31, 2021, filtered for Australia-based users only. Sentiment analysis of the tweets was performed using the Valence Aware Dictionary and Sentiment Reasoner. Topic modeling exploring the content of tweets was conducted using latent Dirichlet allocation with BigML (BigML, Inc). Sentiment, topic, and engagement (the sum of likes, retweets, quotations, and replies) were compared across years. Results In total, 38,070 tweets were collected from 14,880 Twitter users. Overall, the sentiment when discussing food security was positive, although this varied across the 3 years. Positive sentiment remained higher during the COVID-19 lockdown periods in Australia. The topic model contained 10 topics (in order from highest to lowest probability in the data set): “Global production,” “Food insecurity and health,” “Use of food banks,” “Giving to food banks,” “Family poverty,” “Food relief provision,” “Global food insecurity,” “Climate change,” “Australian food insecurity,” and “Human rights.” The topic “Giving to food banks,” which focused on support and donation, had the highest proportion of positive sentiment, and “Global food insecurity,” which covered food insecurity prevalence worldwide, had the highest proportion of negative sentiment. When compared with news, there were some events, such as COVID-19 support payment introduction and bushfires across Australia, that were associated with high periods of positive or negative sentiment. Topics related to food insecurity prevalence, poverty, and food relief in Australia were not consistently more prominent during the COVID-19 pandemic than before the pandemic. Negative tweets received substantially higher engagement across 2019 and 2020. There was no clear relationship between topics that were more likely to be positive or negative and have higher or lower engagement, indicating that the identified topics are discrete issues. Conclusions In this study, we demonstrated the potential use of sentiment analysis and topic modeling to explore evolution in conversations on food security using social media data. Future use of NLP in food security requires the context of and interpretation by public health experts and the use of broader data sets, with the potential to track dimensions or events related to food security to inform evidence-based decision-making in this area.",
        "link": "https://www.semanticscholar.org/paper/ebce1fd678699e6538dba5527766ae71bbcc89e4",
        "published": "2024",
        "pdf_url": "https://www.jmir.org/2024/1/e47826/PDF",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_77.pdf"
    },
    {
        "title": "Real Time Twitter Sentiment Analysis using Natural Language Processing",
        "abstract": "—Social media websites have emerged as one of the platforms to raise users’ opinions and influence the way any business is commercialized. Opinion of people matters a lot to analyze how the propagation of information impacts the lives in a large-scale network like Twitter. Data analysis of the tweets determine the polarity and inclination of vast population towards specific topic, item or entity. These days, the applications of such analysis can be easily observed during public elections, movie promotions, brand endorsements and many other fields. In this project, we will go through making a program that analyzes the nature of tweets on a particular topic. The primary aim is to provide a method for analyzing polarity score in noisy twitter streams. This paper reports on the design of a data analysis, extracting vast number of tweets. Results classify user's perception via tweets into positive and negative. In this project, we will go through making a program that analyzes the nature of tweets on a particular topic. The user will be able to input a keyword(hashtag) and get the nature on it based on the latest tweets that contain the input keyword. Each tweet extracted classified based on its sentiment whether it is a positive or negative. Data were collected on movie reviews which were on IMDB Website. Naïve Bayes machine learning algorithm was used. The result from this model was tested using various testing metrics. Moreover, our model demonstrates strong performance on mining texts extracted directly from Twitter.",
        "link": "https://www.semanticscholar.org/paper/e98e0663facc74dd282b26d3b7fe529d2c51590a",
        "published": "2020",
        "pdf_url": "https://doi.org/10.17577/ijertv9is070406",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_78.pdf"
    },
    {
        "title": "Twitter Sentiment Analysis using Natural Language Processing",
        "abstract": "Social media is the richest source of text generated by the user. So there is a necessity to automate the system to help organizing and classifying the opinions posted on social media sites. Proposed methodology framework using Artificial Recurrent Neural Network (ARNN) with bi-directional long short term memory (LSTM) has been used for the classification of sentiments. Structure for RNN with bidirectional LSTM is depicted. US airline Twitter sentiment dataset has been analysed using bidirectional LSTM model. Text with varying length is taken for the experiment. Graphical representation of the analysis has been depicted in this paper. Confusion matrix shows the result. At the end it is concluded that the sentiments are analysed and classified as positive, negative or neutral.",
        "link": "https://www.semanticscholar.org/paper/b128626a2029b337ebc6dc34360affdd6ee9099c",
        "published": "2021",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Telugu Movie Review Sentiment Analysis Using Natural Language Processing Approach",
        "abstract": null,
        "link": "https://www.semanticscholar.org/paper/1319f61dca074271d65a8c9069e892728e6d87ef",
        "published": "2020",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Twitter Sentiment Analysis Using Natural Language Processing",
        "abstract": null,
        "link": "https://www.semanticscholar.org/paper/f8dbc4462080a49b07ff0c215c29049d50adbe23",
        "published": "2019",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Public discourse and sentiment during Mpox outbreak: an analysis using natural language processing.",
        "abstract": null,
        "link": "https://www.semanticscholar.org/paper/c71174ee94f0f68db30adb3644f879b7ede0d6c8",
        "published": "2023",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Data Extraction Approach using Natural Language Processing for Sentiment Analysis",
        "abstract": "The branch of research known as “sentiment analysis and opinion mining” focuses on extracting meaning from the written words of others by studying their thoughts, feelings, judgments, and attitudes. Natural language processing is one of the most active study fields in data mining, web mining, and text mining. There are numerous uses of sentiment analysis, such as assessing the impact of events on social networks and gauging public opinion on products and services. In the same way as blogs, forums, microblogs, and social networks such as Twitter and Facebook have grown in popularity, sentiment analysis is becoming increasingly important. It is possible to measure sentiments that are captured in digital form using supervised machine learning and lexical-based techniques.",
        "link": "https://www.semanticscholar.org/paper/c144855efdeaa322d8f6f17548546b93e46fe893",
        "published": "2022",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "An exploratory content and sentiment analysis of the guardian metaverse articles using leximancer and natural language processing",
        "abstract": "The metaverse has become one of the most popular concepts of recent times. Companies and entrepreneurs are fiercely competing to invest and take part in this virtual world. Millions of people globally are anticipated to spend much of their time in the metaverse, regardless of their age, gender, ethnicity, or culture. There are few comprehensive studies on the positive/negative sentiment and effect of the newly identified, but not well defined, metaverse concept that is already fast evolving the digital landscape. Thereby, this study aimed to better understand the metaverse concept, by, firstly, identifying the positive and negative sentiment characteristics and, secondly, by revealing the associations between the metaverse concept and other related concepts. To do so, this study used Natural Language Processing (NLP) methods, specifically Artificial Intelligence (AI) with computational qualitative analysis. The data comprised metaverse articles from 2021 to 2022 published on The Guardian website, a key global mainstream media outlet. To perform thematic content analysis of the qualitative data, this research used the Leximancer software, and the The Natural Language Toolkit (NLTK) from NLP libraries were used to identify sentiment. Further, an AI-based Monkeylearn API was used to make sectoral classifications of the main topics that emerged in the Leximancer analysis. The key themes which emerged in the Leximancer analysis, included \"metaverse\", \"Facebook\", \"games\" and \"platforms\". The sentiment analysis revealed that of all articles published in the period of 2021–2022 about the metaverse, 61% (n = 622) were positive, 30% (n = 311) were negative, and 9% (n = 90) were neutral. Positive discourses about the metaverse were found to concern key innovations that the virtual experiences brought to users and companies with the support of the technological infrastructure of blockchain, algorithms, NFTs, led by the gaming world. Negative discourse was found to evidence various problems (misinformation, harmful content, algorithms, data, and equipment) that occur during the use of Facebook and other social media platforms, and that individuals encountered harm in the metaverse or that the metaverse produces new problems. Monkeylearn findings revealed “marketing/advertising/PR” role, “Recreational” business, “Science & Technology” events as the key content topics. This study’s contribution is twofold: first, it showcases a novel way to triangulate qualitative data analysis of large unstructured textual data as a method in exploring the metaverse concept; and second, the study reveals the characteristics of the metaverse as a concept, as well as its association with other related concepts. Given that the topic of the metaverse is new, this is the first study, to our knowledge, to do both.",
        "link": "https://www.semanticscholar.org/paper/f5c1241448c2a830e0848999fb43d9a1f8ba6690",
        "published": "2023",
        "pdf_url": "https://journalofbigdata.springeropen.com/counter/pdf/10.1186/s40537-023-00773-w",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_84.pdf"
    },
    {
        "title": "Twitter-Based Sentiment Analysis and Topic Modeling of Social Media Posts Using Natural Language Processing, to Understand People’s Perspectives Regarding COVID-19 Booster Vaccine Shots in India: Crucial to Expanding Vaccination Coverage",
        "abstract": "This study analyzed perceptions of Indians regarding COVID-19 booster dose vaccines using natural language processing techniques, particularly, sentiment analysis and topic modeling. We analyzed tweets generated by Indian citizens for this study. In late July 2022, the Indian government hastened the process of COVID-19 booster dose vaccinations. Understanding the emotions and concerns of the citizens regarding the health policy being implemented will assist the government, health policy officials, and policymakers implement the policy efficiently so that desired results can be achieved. Seventy-six thousand nine hundred seventy-nine tweets were used for this study. The sentiment analysis study revealed that out of those 76,979 tweets, more than half (n = 40,719 tweets (52.8%) had negative sentiments, 24,242 tweets (31.5%) had neutral sentiments, and 12,018 tweets (15.6%) had positive sentiments. Social media posts by Indians on the COVID-19 booster doses have focused on the feelings that younger people do not need vaccines and that vaccinations are unhealthy.",
        "link": "https://www.semanticscholar.org/paper/1424ebe788f04bbc5ace402630c78ef47db9e25b",
        "published": "2022",
        "pdf_url": "https://www.mdpi.com/2076-393X/10/11/1929/pdf?version=1668498197",
        "pdf_path": null
    },
    {
        "title": "Quantum Natural Language Processing Based Sentiment Analysis Using Lambeq Toolkit",
        "abstract": "Sentiment classification is one of the best use cases of classical natural language processing (NLP). We witness its power in various domains such as banking, business, and the marketing industry. We already know how classical AI and machine learning can change and improve technology. Quantum natural language processing (QNLP) is a young and gradually emerging technology that can provide a quantum advantage for NLP tasks. In this paper, we show the first application of QNLP for sentiment analysis and achieve perfect test set accuracy for three different kinds of simulations and decent accuracy for experiments run on a noisy quantum device. We utilize the lambeq QNLP toolkit and t|ket > by Cambridge Quantum (Quantinuum) to produce the results.",
        "link": "https://www.semanticscholar.org/paper/81b6831059448cd820c9e7db12fd986ed0470590",
        "published": "2022",
        "pdf_url": "https://arxiv.org/pdf/2305.19383",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_86.pdf"
    },
    {
        "title": "A Review of Natural Language Processing Techniques for Sentiment Analysis using Pre-trained Models",
        "abstract": "Research and industry are becoming highly interested in automatically analyzing the opinion of general public from social networks with respect to a particular subject. Extracting the polarity from these data is always remaining as a significant bottleneck. Pre-trained models built on deep learning architecture can achieve this task in an effective manner by using transfer learning approach. Since it is difficult to develop a model from scratch, due to time constraints or computational limits, pre-trained models with vast potential and possibilities were introduced. They provide a benchmark to either improve the existing model or test the developed model against it. This paper discusses about various word embedding methods used for sentiment analysis followed by an overview on state-of-the-art pre-trained models used for natural language processing, which is commonly used in the process of sentiment analysis. Experimental results of two state-of-the-art pre-trained models are also analyzed.",
        "link": "https://www.semanticscholar.org/paper/c0cc3f2cb0a762f979a180788bfe573c34649791",
        "published": "2020",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Natural Language Processing and Sentiment Analysis on Bangla Social Media Comments on Russia-Ukraine War Using Transformers",
        "abstract": null,
        "link": "https://www.semanticscholar.org/paper/0baceee74389d2cf5d1f113d18ccc2ebae1514d0",
        "published": "2023",
        "pdf_url": "https://doi.org/10.1142/s2196888823500021",
        "pdf_path": null
    },
    {
        "title": "SENTIMENT ANALYSIS OF STUDENTS’ FEEDBACK ON INSTITUTIONAL FACILITIES USING TEXT-BASED CLASSIFICATION AND NATURAL LANGUAGE PROCESSING (NLP)",
        "abstract": "In this study, sentiment analysis, commonly referred to as opinion mining or emotional artificial intelligence (AI), is used to obtain student comments about institutional facilities. To ascertain whether an online text has a good, negative, or neutral emotional tone, it must first be analyzed. Natural Language Processing (NLP) includes the subfield of sentiment analysis, and NLP can be used to categorize and extract information with the aid of machine learning methods. Finding out if students are content with the amenities or services provided is important since, in an educational setting, they are consumers. This study of the resources and services that the libraries offer evaluated college students' perceptions of the books, audio CDs, and video CDs, the services provided by the library staff, and the personal computers that are made available to them as part of their facilities. In the current study, surveys were carried out to gather information and assess how well the needs of the students are addressed. On Kaggle.com, secondary data from a North Indian institution was used in the experiments. The research approach was sentiment analysis using a machine learning framework. The F1-score, a harmonic mean of precision and recall based on the attitudes evaluated by the algorithms, was calculated using a text-based classification method using Naive Bayes Multinomial and Support Vector machine learning algorithms. The findings offer views on how successfully library facilities are managed in the form of student sentiments.",
        "link": "https://www.semanticscholar.org/paper/1917e904c55529696a73ea4247b4907ad7b0a2f2",
        "published": "2023",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Sentiment analysis on social media tweets using dimensionality reduction and natural language processing",
        "abstract": "Social media has been embraced by different people as a convenient and official medium of communication. People write or share messages and attach images and videos on Twitter, Facebook and other social media platforms. It therefore generates a lot of data that is rich in sentiments. Sentiment analysis has been used to determine the opinions of clients, for instance, relating to a particular product or company. Lexicon and machine learning approaches are the strategies that have been used to analyze these sentiments. The performance of sentiment analysis is, however, distorted by noise, the curse of dimensionality, the data domains and the size of data used for training and testing. This article aims at developing a model for sentiment analysis of social media data in which dimensionality reduction and natural language processing with part of speech tagging are incorporated. The model is tested using Naïve Bayes, support vector machine, and K‐nearest neighbor algorithms, and its performance compared with that of two other sentiment analysis models. Experimental results show that the model improves sentiment analysis performance using machine learning techniques.",
        "link": "https://www.semanticscholar.org/paper/23f1281804195b77b21a094cc4e9488af1004f58",
        "published": "2022",
        "pdf_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/eng2.12579",
        "pdf_path": null
    },
    {
        "title": "Sentiment analysis: capturing favorability using natural language processing",
        "abstract": null,
        "link": "https://www.semanticscholar.org/paper/ababc1999b5f31409c78c39d1842219821e37a6d",
        "published": "2003",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Using Natural Language Processing and Sentiment Analysis to Augment Traditional User-Centered Design: Development and Usability Study",
        "abstract": "Background Sarcopenia, defined as the age-associated loss of muscle mass and strength, can be effectively mitigated through resistance-based physical activity. With compliance at approximately 40% for home-based exercise prescriptions, implementing a remote sensing system would help patients and clinicians to better understand treatment progress and increase compliance. The inclusion of end users in the development of mobile apps for remote-sensing systems can ensure that they are both user friendly and facilitate compliance. With advancements in natural language processing (NLP), there is potential for these methods to be used with data collected through the user-centered design process. Objective This study aims to develop a mobile app for a novel device through a user-centered design process with both older adults and clinicians while exploring whether data collected through this process can be used in NLP and sentiment analysis Methods Through a user-centered design process, we conducted semistructured interviews during the development of a geriatric-friendly Bluetooth-connected resistance exercise band app. We interviewed patients and clinicians at weeks 0, 5, and 10 of the app development. Each semistructured interview consisted of heuristic evaluations, cognitive walkthroughs, and observations. We used the Bing sentiment library for a sentiment analysis of interview transcripts and then applied NLP-based latent Dirichlet allocation (LDA) topic modeling to identify differences and similarities in patient and clinician participant interviews. Sentiment was defined as the sum of positive and negative words (each word with a +1 or −1 value). To assess utility, we used quantitative assessment questionnaires—System Usability Scale (SUS) and Usefulness, Satisfaction, and Ease of use (USE). Finally, we used multivariate linear models—adjusting for age, sex, subject group (clinician vs patient), and development—to explore the association between sentiment analysis and SUS and USE outcomes. Results The mean age of the 22 participants was 68 (SD 14) years, and 17 (77%) were female. The overall mean SUS and USE scores were 66.4 (SD 13.6) and 41.3 (SD 15.2), respectively. Both patients and clinicians provided valuable insights into the needs of older adults when designing and building an app. The mean positive-negative sentiment per sentence was 0.19 (SD 0.21) and 0.47 (SD 0.21) for patient and clinician interviews, respectively. We found a positive association with positive sentiment in an interview and SUS score (ß=1.38; 95% CI 0.37 to 2.39; P=.01). There was no significant association between sentiment and the USE score. The LDA analysis found no overlap between patients and clinicians in the 8 identified topics. Conclusions Involving patients and clinicians allowed us to design and build an app that is user friendly for older adults while supporting compliance. This is the first analysis using NLP and usability questionnaires in the quantification of user-centered design of technology for older adults.",
        "link": "https://www.semanticscholar.org/paper/b87ababbf4063746a1801a7d548d35953158768d",
        "published": "2020",
        "pdf_url": "https://mhealth.jmir.org/2020/8/e16862/PDF",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_92.pdf"
    },
    {
        "title": "Sentiment Analysis based Multi-Person Multi-criteria Decision Making methodology using natural language processing and deep learning for smarter decision aid. Case study of restaurant choice using TripAdvisor reviews",
        "abstract": null,
        "link": "https://www.semanticscholar.org/paper/49972c290148e033cc1d0e988427695962c49086",
        "published": "2020",
        "pdf_url": "https://arxiv.org/pdf/2008.00032",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_93.pdf"
    },
    {
        "title": "Sentiment Analysis of Mixed-Case Language using Natural Language Processing",
        "abstract": "Social Networking has become a platform for people to post their views and opinions about everything. People tend to mix their regional language with other languages that they are familiar with which gives rise to Mixed-Case Languages. These multilingual texts pose a great challenge to conventional Natural Language Processing systems, which currently rely greatly on monolingual resources and cannot handle the combination of multiple languages. The study of people's attitude, opinions, views and to classify them as positive, negative or neutral is called Sentiment Analysis. It is an extremely powerful tool in today's world since it allows businesses, restaurants, internet providers, airlines, etc to quickly detect dissatisfied customers, categorize issues with urgency and prioritize responses. The proposed system focuses on the sentiment analysis of a Hinglish (Hindi-English) text corpus. This paper discusses various approaches such as the Lexicon-Based, Rule-Based and Machine Learning approaches to study the effectiveness of the approach chosen for classifying the text corpus with their appropriate sentiment labels. The proposed Machine Learning techniques are evaluated using parameters Precision, Recall, F1-score and Accuracy and out of all the approaches used, the Support Vector Machine (SVM) and Logistic Regression (LR) approaches have given the best results with both algorithms giving an F1-score of 0.86 and accuracy of 86%.",
        "link": "https://www.semanticscholar.org/paper/2809aea9f23c4989f9e46a7daf21b8e03147cc09",
        "published": "2021",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Sentiment analysis of product feedback using natural language processing",
        "abstract": null,
        "link": "https://www.semanticscholar.org/paper/0e3963acf8d2f4df07d64eba9f6591e33e01b35a",
        "published": "2021",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Natural Language Processing for Arabic Sentiment Analysis: A Systematic Literature Review",
        "abstract": "Sentiment analysis involves using computational methods to identify and classify opinions expressed in text, with the goal of determining whether the writer's stance towards a particular topic, product, or idea is positive, negative, or neutral. However, sentiment analysis in Arabic presents unique challenges due to the complexity of Arabic morphology and the variety of dialects, which make language classification even more difficult. To address these challenges, we conducted to investigation and overview the techniques used in the last five years for embedding and classification of Arabic sentiment analysis (ASA). We collected data from 100 publications, resulting in a representative dataset of 2,300 detailed records that included attributes related to the dataset, feature extraction, approach, parameters, and performance measures. Our study aimed to identify the most powerful approaches and best model settings by analyzing the collected data to identify the significant parameters influencing performance. The results showed that Deep Learning and Machine Learning were the most commonly used techniques, followed by lexicon and transformer-based techniques. However, Deep Learning models were found to be more accurate for sentiment classification than other Machine Learning models. Furthermore, multi-level embedding was found to be a significant step in improving model accuracy.",
        "link": "https://www.semanticscholar.org/paper/1042cbab483be8d8bf0635141a0dcc5fa8d45761",
        "published": "2024",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Content Analysis Using Specific Natural Language Processing Methods for Big Data",
        "abstract": "Researchers from different fields have studied the effects of the COVID-19 pandemic and published their results in peer-reviewed journals indexed in international databases such as Web of Science (WoS), Scopus, PubMed. Focusing on efficient methods for navigating the extensive literature on COVID-19 pandemic research, our study conducts a content analysis of the top 1000 cited papers in WoS that delve into the subject by using elements of natural language processing (NLP). Knowing that in WoS, a scientific paper is described by the group Paper = {Abstract, Keyword, Title}; we obtained via NLP methods the word dictionaries with their frequencies of use and the word cloud for the 100 most used words, and we investigated if there is a degree of similarity between the titles of the papers and their abstracts, respectively. Using the Python packages NLTK, TextBlob, VADER, we computed sentiment scores for paper titles and abstracts, analyzed the results, and then, using Azure Machine Learning-Sentiment analysis, extended the range of comparison of sentiment scores. Our proposed analysis method can be applied to any research topic or theme from papers, articles, or projects in various fields of specialization to create a minimal dictionary of terms based on frequency of use, with visual representation by word cloud. Complementing the content analysis in our research with sentiment and similarity analysis highlights the different or similar treatment of the topics addressed in the research, as well as the opinions and feelings conveyed by the authors in relation to the researched issue.",
        "link": "https://www.semanticscholar.org/paper/2a2a31613120aa79b03b9eef2ba2e43b7a9e2484",
        "published": "2024",
        "pdf_url": "https://www.mdpi.com/2079-9292/13/3/584/pdf?version=1706701253",
        "pdf_path": null
    },
    {
        "title": "Hybrid Natural Language Processing Model for Sentiment Analysis during Natural Crisis",
        "abstract": "This paper introduces a novel natural language processing (NLP) model as an original approach to sentiment analysis, with a focus on understanding emotional responses during major disasters or conflicts. The model was created specifically for Croatian and is based on unigrams, but it can be used with any language that supports the n-gram model and expanded to multiple word sequences. The presented model generates a sentiment score aligned with discrete and dimensional emotion models, reliability metrics, and individual word scores using affective datasets Extended ANEW and NRC WordEmotion Association Lexicon. The sentiment analysis model incorporates different methodologies, including lexicon-based, machine learning, and hybrid approaches. The process of preprocessing includes translation, lemmatization, and data refinement, utilized automated translation services as well as the CLARIN Knowledge Centre for South Slavic languages (CLASSLA) library, with a particular emphasis on diacritical mark correction and tokenization. The presented model was experimentally evaluated on three simultaneous major natural crises that recently affected Croatia. The study’s findings reveal a significant shift in emotional dimensions during the COVID-19 pandemic, particularly a decrease in valence, arousal, and dominance, which corresponded with the two-month recovery period. Furthermore, the 2020 Croatian earthquakes elicited a wide range of negative discrete emotions, including anger, fear, and sadness, with the recuperation period much longer than in the case of COVID-19. This study represents an advancement in sentiment analysis, particularly in linguistically specific contexts, and provides insights into the emotional landscape shaped by major societal events.",
        "link": "https://www.semanticscholar.org/paper/2f6e769829399c453a8da74708b92a511d433c10",
        "published": "2024",
        "pdf_url": "https://www.mdpi.com/2079-9292/13/10/1991/pdf?version=1716193245",
        "pdf_path": null
    },
    {
        "title": "A Study of Profanity Effect in Sentiment Analysis on Natural Language Processing Using ANN",
        "abstract": "The development of wireless communication technology and mobile devices has brought about the advent of an era of sharing text data that overflows on social media and the web. In particular, social media has become a major source of storing people’s sentiments in the form of opinions and views on specific issues in the form of unstructured information. Therefore, the importance of emotion analysis is increasing, especially with machine learning for both personal life and companies’ management environments. At this time, data reliability is an essential component for data classification. The accuracy of sentiment classification can be heavily determined according to the reliability of data, in which case noise data may also influence this classification. Although there is stopword that does not have meaning in such noise data, data that does not fit the purpose of analysis can also be referred to as noise data. This paper aims to provide an analysis of the impact of profanity data on deep learning-based sentiment classification. For this purpose, we used movie review data on the Web and simulated the changes in performance before and after the removal of the profanity data. The accuracy of the model trained with the data and the model trained with the data before removal were compared to determine whether the profanity is noise data that lowers the accuracy in sentiment analysis. The simulation results show that the accuracy dropped by about 2% when judging profanity as noise data in the sentiment classification for review data.",
        "link": "https://www.semanticscholar.org/paper/59c222eec7375092c428a0b0b9f4c443012432cc",
        "published": "2022",
        "pdf_url": "https://doi.org/10.13052/jwe1540-9589.2139",
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis of Multilingual Twitter Data using Natural Language Processing",
        "abstract": "The feelings of WEB users have a great influence on rest of the users, product sellers and market analysis. It is necessary to well structure the unstructured data from various social platforms for proper and meaningful analyses. For the classification of multilingual data, the analysis of feelings has recognized significant attention. This is called textual organization that may be used to classify state of mind or feelings expressed in different ways like: negative, positive, favorable, unfavorable, thumbs up, thumbs down, etc. in the field of Automatic Language Processing (NLP). To solve this kind of problem, sentiment analysis and deep learning techniques are two merging techniques. Because of machine learning ability, deep learning models are effectively used for this purpose. Recurrent Neural Networks (RNN) and Naive Bayes algorithm are two popular deep learning architectures to analyze feelings in sentences. These architectures may be used in natural language processing. In this research article, we propose solutions to multilingual sentiment analysis problem by implementing algorithms and in order to contract the result, we compare precision factor to find the best solution for multilingual sentimental analysis.",
        "link": "https://www.semanticscholar.org/paper/52a93f953e8211cc383ae5b5b1bc1bbc62eacf7c",
        "published": "2018",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Emoji, Text, and Sentiment Polarity Detection Using Natural Language Processing",
        "abstract": "Virtual users generate a gigantic volume of unbalanced sentiments over various online crowd-sourcing platforms which consist of text, emojis, or a combination of both. Its accurate analysis brings profits to various industries and their services. The state-of-art detects sentiment polarity using common sense with text only. The research work proposes an emoji-based framework for cognitive–conceptual–affective computing of sentiment polarity based on the linguistic patterns of text and emojis. The proposed emoji and text-based parser articulates sentiments with proposed linguistic features along with a combination of different emojis to generate the part of speech into n-gram patterns. In this paper, the sentiments of 650 world-famous personages consisting of 1,68,548 tweets have been downloaded from across the world. The results illustrate that the proposed natural language processing framework shows that the existence of emojis in sentiments many times seems to change the overall polarity of the sentiment. By extension, the CLDR name of the emoji is utilized to evaluate the accurate polarity of emoji patterns, and a dictionary of sentiments is adopted for evaluating the polarity of text. Eventually, the performances of three ML classifiers (SVM, DT, and Naïve Bayes) are evaluated for proposed distinctive linguistic features. The robust experiments indicate that the proposed approach outperforms the SVM classifier as compared to other ML classifiers. The proposed polarity detection generator has achieved an exceptional perspective of sentiments presented in the sentence by employing the flow of concept established, based on linguistic features, polarity inversion, coordination, and discourse patterns, surpassing the performance of extant state-of-the-art approaches.",
        "link": "https://www.semanticscholar.org/paper/f83b09a7f582722538a87f382c92fe4d41f98eca",
        "published": "2023",
        "pdf_url": "https://www.mdpi.com/2078-2489/14/4/222/pdf?version=1681102897",
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis on Twitter by Using TextBlob for Natural Language Processing",
        "abstract": "— The Internet has become an innovative platform regarding online learning, exchanging content, sharing views. In this paper, we will use Twitter as our social networking platform. Sentiment analysis on Twitter is based on opinion mining on posts to obtain the user’s point of view. The leading goal deals with how opinion mining techniques can be accessed to analyze some of the tweets in many reports involving various types of tweet languages on Twitter and classify its polarity. Practical implication shows that the proposed machine learning classifiers are efficient and highly accurate.",
        "link": "https://www.semanticscholar.org/paper/16b5eee5735396453f9a1dd607c12e110b4f6934",
        "published": "2020",
        "pdf_url": "https://annals-csis.org/proceedings/icrmat2020/drp/pdf/20.pdf",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_102.pdf"
    },
    {
        "title": "Study of Natural Language Processing for Sentiment Analysis",
        "abstract": "The study of opinions, sentiments, assessments, perspectives, and feelings as they are expressed in written language is the focus of sentiment analysis and evaluation mining. It is commonly the subject of text mining, information mining, and web mining because it is one of the most active study fields in natural language processing. Sentiment analysis has been applied in many different contexts, including the study of how events affect unofficial groups and the exploration of presumptions about goods and services. The importance of sentiment analysis is increasing at the same time as virtual entertainment such as surveys, group chats, web blogs, micro sites, Twitter, and interpersonal organizations. In this work, we provide the results of our preliminary studies on twitter sentiment analysis. This study seeks to distinguish subjects from sentiment in tweets. It recognizes the sentiment that refers to the particular problem using Natural Language Processing techniques. Our analysis consists of three main processes, subjective grouping, semantic affiliation, and extreme order, to characterize sentiment. By describing the syntactic relationship between sentiment dictionaries and subject, the study makes use of sentiment vocabularies. Exploratory results demonstrate that the proposed framework performs better than existing message sentiment analysis tools because tweets don't have the same architecture as traditional messages.",
        "link": "https://www.semanticscholar.org/paper/e650bfd0cafd31e41ab1c81ece40bbb3154c2d57",
        "published": "2023",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Simple Sentiment Analysis Ansatz for Sentiment Classification in Quantum Natural Language Processing",
        "abstract": "Sentiment classification is a valuable application of natural language processing that has seen wide usage in optimizing business processes. This paper explores a novel implementation of sentiment analysis using the Variational Quantum Algorithms (VQA) framework. As ansatz choice determines model performance in VQA, this paper proposes an alternative ansatz for the sentiment classification task in quantum representation. Specifically, it builds upon previous work in quantum sentiment classification by proposing an alternative ansatz to the Instantaneous Quantum Polytime ansatz, entitled Simple Sentiment Analysis (SimpleSA) ansatz. A key feature of the SimpleSA ansatz is the decision to neglect noun parameterization. The proposed SimpleSA has less complexity than the other ansätze in terms of the number of parameters and the number of gates. Moreover, experimental results show that the SimpleSA ansatz with H-CNOT-Rz-H compound block construction outperforms the Instantaneous Quantum Polytime (IQP) ansatz at 85.00% accuracy. Furthermore, SimpleSA optimization converges 20.89% faster than Instantaneous Quantum Polytime (IQP) for the Simultaneous Perturbation Stochastic Approximation (SPSA) method with 130 iterations. The proposed work is useful for applications of quantum computers for sentiment analyses and classifications.",
        "link": "https://www.semanticscholar.org/paper/c808ce077087ed441c9136de4d6cbc88480d5a9b",
        "published": "2023",
        "pdf_url": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/10296902.pdf",
        "pdf_path": null
    },
    {
        "title": "Customer Sentiment Analysis in Hotel Reviews Through Natural Language Processing Techniques",
        "abstract": "—Customer reviews of products and services play a key role in the customers' decision to buy a product or use a service. Customers' preferences and choices are influenced by the opinions of others online; on blogs or social networks. New customers are faced with many views on the web, but they can't make the right decision. Hence, the need for sentiment analysis is to clarify whether opinions are positive, negative or neutral. This paper suggests using the Aspect-Based Sentiment Analysis approach on reviews extracted from tourism websites such as TripAdvisor and Booking. This approach is based on two main steps namely aspect extraction and sentiment classification related to each aspect. For aspect extraction, an approach based on topic modeling is proposed using the semi-supervised CorEx (Correlation Explanation) method for labeling word sequences into entities. As for sentiment classification, various supervised machine learning techniques are used to associate a sentiment (positive, negative or neutral) to a given aspect expression. Experiments on opinion corpora have shown very encouraging performances.",
        "link": "https://www.semanticscholar.org/paper/7644b74ef194b84c219df83ab16cecd43ec1af87",
        "published": "2023",
        "pdf_url": "http://thesai.org/Downloads/Volume14No1/Paper_62-Customer_Sentiment_Analysis_in_Hotel_Reviews.pdf",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_105.pdf"
    },
    {
        "title": "Sentiment Analysis using Support Vector Machine and Random Forest",
        "abstract": "Sentiment analysis, is commonly known as opinion mining, is a vital field in natural language processing (NLP) that claims to find out the sentiment or emotion expressed in a given text. This research paper demonstrates an exhaustive survey of sentiment analysis, focusing on the application of machine learning techniques. Comprehensive parametric literature review has been completed to determine the sentiment analysis using SVM and Random Forest. Additionally, the paper covers preprocessing techniques, feature extraction, model training, evaluation, and challenges encountered in sentiment analysis. The findings of this research contribute to a deeper understanding of sentiment analysis and provide insights into the effectiveness of machine learning approaches in this domain. Based on the results obtained, two machine learning algorithms named as Random Forest and SVM were evaluated based on their accuracy in a classification task. The Random Forest algorithm achieved an accuracy of 0.78564, while SVM outperformed it slightly with an accuracy of 0.80394. Both Random Forest and SVM have demonstrated their strengths in achieving respectable accuracies in the given classification task. These results suggest that SVM, with its slightly higher accuracy of 0.80394, may be a more suitable choice when accuracy is the primary concern. However, the basic configuration need and characteristics of the problem at hand should be considered when choosing the better algorithm with better results.",
        "link": "https://www.semanticscholar.org/paper/ecfc7c684481399ef6c77ad3a75b4ab49d126dd1",
        "published": "2024",
        "pdf_url": "https://journals.mmupress.com/index.php/jiwe/article/download/598/461",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_106.pdf"
    },
    {
        "title": "Using Natural Language Processing to Analyze Political Party Manifestos from New Zealand",
        "abstract": "This study explores how natural language processing (NLP) can supplement content analyses of political documents, particularly the manifestos of political parties. NLP is particularly useful for tasks such as: estimating the similarity between documents, identifying the topics discussed in documents (topic modeling), and sentiment analysis. This study applies each of these techniques to the study of political party manifestos. Document similarity may be used to gain some insight into the way parties change over time and which political parties are successful at bringing attention to their policy agenda. Categorizing text into topics may help objectively categorize and visualize the ideas political parties are discussing. Finally, sentiment analysis has the potential to show each political party’s attitude towards a policy area/topic. This study specifically applies these techniques to the manifestos produced by the political parties of New Zealand, from 1987 to 2017 (a period of significant party system change in New Zealand). It finds that NLP techniques provide valuable insights, although there is a need for significant fine-tuning.",
        "link": "https://www.semanticscholar.org/paper/69ad1a3e4a0338ecb10b83dab896cd508eb2010d",
        "published": "2023",
        "pdf_url": "https://www.mdpi.com/2078-2489/14/3/152/pdf?version=1677648581",
        "pdf_path": null
    },
    {
        "title": "An automated essay evaluation system using natural language processing and sentiment analysi",
        "abstract": "An automated essay evaluation system is a machine-based approach leveraging long short-term memory (LSTM) model to award grades to essays written in English language. natural language processing (NLP) is used to extract feature representations from the essays. The LSTM network learns from the extracted features and generates parameters for testing and validation. The main objectives of the research include proposing and training an LSTM model using a dataset of manually graded essays with scores. Sentiment analysis is performed to determine the sentiment of the essay as either positive, negative or neutral. The twitter sample dataset is used to build sentiment classifier that analyzes the sentiment based on the student’s approach towards a topic. Additionally, each essay is subjected to detection of syntactical errors as well as plagiarism check to detect the novelty of the essay. The overall grade is calculated based on the quality of the essay, the number of syntactic errors, the percentage of plagiarism found and sentiment of the essay. The corrected essay is provided as feedback to the students. This essay grading model has gained an average quadratic weighted kappa (QWK) score of 0.911 with 99.4% accuracy for the sentiment analysis classifier.",
        "link": "https://www.semanticscholar.org/paper/e4ba970cbcbbb1e2a7f3b52536f93fd25f080572",
        "published": "2022",
        "pdf_url": "https://ijece.iaescore.com/index.php/IJECE/article/download/28738/16158",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_108.pdf"
    },
    {
        "title": "Sentiment Analysis for Visuals using Natural Language Processing",
        "abstract": null,
        "link": "https://www.semanticscholar.org/paper/c8c1275bc8c94f605b9edc30e81cc991f8d1ec33",
        "published": "2015",
        "pdf_url": "https://doi.org/10.5120/ijca2015906581",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_109.pdf"
    },
    {
        "title": "Aspect Based Feature Extraction in Sentiment Analysis using Bi-GRU-LSTM Model",
        "abstract": "In Natural Language Processing (NLP), Sentiment Analysis (SA) is a fundamental process which predicts the sentiment expressed in sentences. In contrast to conventional sentiment analysis, Aspect-Based Sentiment Analysis (ABSA) employs a more nuanced approach to assess the sentiment of individual aspects or components within a document or sentence. Its objective is to identify the sentiment polarity, such as positive, neutral, or negative, associated with particular elements disclosed within a sentence. This research introduces a novel sentiment analysis technique that proves to be more efficient in sentiment analysis compared to current methods. The suggested sentiment analysis method undergoes three key phases: 1. Pre-processing 2. Extraction of aspect sentiment and 3. Sentiment analysis classification. The input text data undergoes pre-processing through the implementation of four typical text normalization techniques, which include stemming, stop word elimination, lemmatization, and tokenization. By employing these methods, the provided text data is prepared and fed into the aspect sentiment extraction phase. During the aspect sentiment extraction phase, features are obtained through a series of steps, including enhanced ATE (Aspect Term Extraction), assessment of word length, and determination of cosine similarity. By following these steps, the relevant features are extracted on the basis of aspects and sentiments involved in the text data. Further, a hybrid classification model is proposed to classify sentiments. In this work, two of the Deep Learning (DL) classifiers, Bi-directional Gated Recurrent Unit (Bi-GRU) and Long Short-Term memory (LSTM) are used in proposing a hybrid classification model which classifies the sentiments effectively and provides accurate final predicted results. Moreover, the performance of proposed sentiment analysis technique is analyzed experimentally to show its efficacy over other models.",
        "link": "https://www.semanticscholar.org/paper/2f25d011c6e7b7722d0313828679e0b3155fae79",
        "published": "2024",
        "pdf_url": "https://doi.org/10.13052/jmm1550-4646.2048",
        "pdf_path": null
    },
    {
        "title": "Off-The-Shelf Artificial Intelligence Technologies for Sentiment and Emotion Analysis: A Tutorial on Using IBM Natural Language Processing",
        "abstract": null,
        "link": "https://www.semanticscholar.org/paper/8ef4e869668afe72fe3dc6733550e69241a62f5b",
        "published": "2019",
        "pdf_url": "https://aisel.aisnet.org/cgi/viewcontent.cgi?article=4149&context=cais",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_111.pdf"
    },
    {
        "title": "Survey of transformers and towards ensemble learning using transformers for natural language processing",
        "abstract": "The transformer model is a famous natural language processing model proposed by Google in 2017. Now, with the extensive development of deep learning, many natural language processing tasks can be solved by deep learning methods. After the BERT model was proposed, many pre-trained models such as the XLNet model, the RoBERTa model, and the ALBERT model were also proposed in the research community. These models perform very well in various natural language processing tasks. In this paper, we describe and compare these well-known models. In addition, we also apply several types of existing and well-known models which are the BERT model, the XLNet model, the RoBERTa model, the GPT2 model, and the ALBERT model to different existing and well-known natural language processing tasks, and analyze each model based on their performance. There are a few papers that comprehensively compare various transformer models. In our paper, we use six types of well-known tasks, such as sentiment analysis, question answering, text generation, text summarization, name entity recognition, and topic modeling tasks to compare the performance of various transformer models. In addition, using the existing models, we also propose ensemble learning models for the different natural language processing tasks. The results show that our ensemble learning models  perform better than a single classifier on specific tasks. Graphical Abstract",
        "link": "https://www.semanticscholar.org/paper/a95f97e4b51eeab38e94b088034ced7c6e31a4c1",
        "published": "2024",
        "pdf_url": "https://journalofbigdata.springeropen.com/counter/pdf/10.1186/s40537-023-00842-0",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_112.pdf"
    },
    {
        "title": "Quantification of Gender Bias and Sentiment Toward Political Leaders Over 20 Years of Kenyan News Using Natural Language Processing",
        "abstract": "Background: Despite a 2010 Kenyan constitutional amendment limiting members of elected public bodies to < two-thirds of the same gender, only 22 percent of the 12th Parliament members inaugurated in 2017 were women. Investigating gender bias in the media is a useful tool for understanding socio-cultural barriers to implementing legislation for gender equality. Natural language processing (NLP) methods, such as word embedding and sentiment analysis, can efficiently quantify media biases at a scope previously unavailable in the social sciences. Methods: We trained GloVe and word2vec word embeddings on text from 1998 to 2019 from Kenya’s Daily Nation newspaper. We measured gender bias in these embeddings and used sentiment analysis to predict quantitative sentiment scores for sentences surrounding female leader names compared to male leader names. Results: Bias in leadership words for men and women measured from Daily Nation word embeddings corresponded to temporal trends in men and women’s participation in political leadership (i.e., parliamentary seats) using GloVe (correlation 0.8936, p = 0.0067, r2 = 0.799) and word2vec (correlation 0.844, p = 0.0169, r2 = 0.712) algorithms. Women continue to be associated with domestic terms while men continue to be associated with influence terms, for both regular gender words and female and male political leaders’ names. Male words (e.g., he, him, man) were mentioned 1.84 million more times than female words from 1998 to 2019. Sentiment analysis showed an increase in relative negative sentiment associated with female leaders (p = 0.0152) and an increase in positive sentiment associated with male leaders over time (p = 0.0216). Conclusion: Natural language processing is a powerful method for gaining insights into and quantifying trends in gender biases and sentiment in news media. We found evidence of improvement in gender equality but also a backlash from increased female representation in high-level governmental leadership.",
        "link": "https://www.semanticscholar.org/paper/7a88182b212dc6b15aa66d58f2840795d1e55100",
        "published": "2021",
        "pdf_url": "https://doi.org/10.3389/fpsyg.2021.712646",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_113.pdf"
    },
    {
        "title": "Toward Bias Analysis Using Tweets and Natural Language Processing",
        "abstract": "Whether intentionally or not, many individuals in society express some form of prejudice or bias in their thinking and communications. Prejudice can be expressed in a multitude of ways and may be directed towards anything in which people can have an opinion. What makes prejudiced/biased thinking different and potentially more dangerous than having an opinion is that they are not always based on one's personal experiences and therefore may be misinformed. With the rise of social media platforms in the last 20 years or so, people have more ways than ever to express their opinions and share their voices. This paper defines an approach to using Twitter, one of the most popular modern-day social media platforms, to analyze an individual's tweets for the purposes of identifying potential biases. Using sentiment analysis along with other natural language processing tools, a score of potential bias of an individual user is calculated. This score can provide insight to the degree and/or frequency at which a person can be expected to exhibit biased behavior or make biased statements and is only meant to serve as a reference.",
        "link": "https://www.semanticscholar.org/paper/222e2b8f391c096eb9dbfbe5f7c8c3a940aa6e7c",
        "published": "2021",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis of Multilingual Tweets Based on Natural Language Processing (NLP)",
        "abstract": null,
        "link": "https://www.semanticscholar.org/paper/928ba144ff48499d55f8e41b7b45575b16904bc3",
        "published": "2021",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Analyzing patient experiences using natural language processing: development and validation of the artificial intelligence patient reported experience measure (AI-PREM)",
        "abstract": "Background Evaluating patients’ experiences is essential when incorporating the patients’ perspective in improving healthcare. Experiences are mainly collected using closed-ended questions, although the value of open-ended questions is widely recognized. Natural language processing (NLP) can automate the analysis of open-ended questions for an efficient approach to patient-centeredness. Methods We developed the Artificial Intelligence Patient-Reported Experience Measures (AI-PREM) tool, consisting of a new, open-ended questionnaire, an NLP pipeline to analyze the answers using sentiment analysis and topic modeling, and a visualization to guide physicians through the results. The questionnaire and NLP pipeline were iteratively developed and validated in a clinical context. Results The final AI-PREM consisted of five open-ended questions about the provided information, personal approach, collaboration between healthcare professionals, organization of care, and other experiences. The AI-PREM was sent to 867 vestibular schwannoma patients, 534 of which responded. The sentiment analysis model attained an F1 score of 0.97 for positive texts and 0.63 for negative texts. There was a 90% overlap between automatically and manually extracted topics. The visualization was hierarchically structured into three stages: the sentiment per question, the topics per sentiment and question, and the original patient responses per topic. Conclusions The AI-PREM tool is a comprehensive method that combines a validated, open-ended questionnaire with a well-performing NLP pipeline and visualization. Thematically organizing and quantifying patient feedback reduces the time invested by healthcare professionals to evaluate and prioritize patient experiences without being confined to the limited answer options of closed-ended questions.",
        "link": "https://www.semanticscholar.org/paper/308b0117b5fb147ab0b9d1c20ed242809170bd6d",
        "published": "2022",
        "pdf_url": "https://bmcmedinformdecismak.biomedcentral.com/counter/pdf/10.1186/s12911-022-01923-5",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_116.pdf"
    },
    {
        "title": "Stress detection using natural language processing and machine learning over social interactions",
        "abstract": "Cyberspace is a vast soapbox for people to post anything that they witness in their day-to-day lives. Social media content is mostly used for review, opinion, influence, or sentiment analysis. In this paper, we aim to extend sentiment and emotion analysis for detecting the stress of an individual based on the posts and comments shared by him/her on social networking platforms. We leverage large-scale datasets with tweets to accomplish sentiment analysis with the aid of machine learning algorithms and a deep learning model, BERT for sentiment classification. We also adopted Latent Dirichlet Allocation which is an unsupervised machine learning method for scanning a group of documents, recognizing the word and phrase patterns within them, and gathering word groups and alike expressions that most precisely illustrate a set of documents. This helps us to predict which topic is linked to the textual data. With the aid of these models, we will be able to detect the emotion of users online. Further, these emotions can be used to analyze stress or depression. In conclusion, the ML models and a BERT model have a very good detection rate. This research is useful for the well-being of one's mental health. The results are evaluated using various metrics at the macro and micro levels and indicate that the trained model detects the status of emotions based on social interactions.",
        "link": "https://www.semanticscholar.org/paper/bc25b9159a8dbe0524ed29bf9e99742c61c12627",
        "published": "2021",
        "pdf_url": "https://journalofbigdata.springeropen.com/track/pdf/10.1186/s40537-022-00575-6",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_117.pdf"
    },
    {
        "title": "Analyzing and Visualizing Text Information in Corporate Sustainability Reports Using Natural Language Processing Methods",
        "abstract": "Sustainability is a major contemporary issue that affects everyone. Many companies now produce an annual sustainability report, mainly intended for their stakeholders and the public, enumerating their goals and degrees of achievement regarding sustainable development. Although sustainability reports are an important resource to understand a company’s sustainability strategies and practices, the difficulty of extracting key information from dozens or hundreds of pages with sustainability and business jargon has highlighted the need for metrics to effectively measure the content of such reports. Accordingly, many researchers have attempted to analyze the concepts and messages from sustainability reports using various natural language processing (NLP) methods. In this study, we propose a novel approach that overcomes the shortcomings of previous studies. Using the sentence similarity method and sentiment analysis, the study clearly shows thematic practices and trends, as well as a significant difference in the balance of positive and negative information in the reports across companies. The results of sentiment analysis prove that the new approach of this study is very useful. It confirms that companies actively use the sustainability report to improve their positive image when they experience a crisis. It confirms that companies actively use the sustainability report to improve their positive image when they experience a crisis. The inferences gained from this method will not only help companies produce better reports that can be utilized effectively, but also provide researchers with ideas for further research. In the concluding section, we summarize the implications of our approach and discuss limitations and future research areas.",
        "link": "https://www.semanticscholar.org/paper/b46a0b7afb8249e8c3e895b006eaff349608a7e5",
        "published": "2022",
        "pdf_url": "https://www.mdpi.com/2076-3417/12/11/5614/pdf?version=1654062906",
        "pdf_path": null
    },
    {
        "title": "Analysis of news sentiments using natural language processing and deep learning",
        "abstract": "This paper investigates if and to what point it is possible to trade on news sentiment and if deep learning (DL), given the current hype on the topic, would be a good tool to do so. DL is built explicitly for dealing with significant amounts of data and performing complex tasks where automatic learning is a necessity. Thanks to its promise to detect complex patterns in a dataset, it may be appealing to those investors that are looking to improve their trading process. Moreover, DL and specifically LSTM seem a good pick from a linguistic perspective too, given its ability to “remember” previous words in a sentence. After having explained how DL models are built, we will use this tool for forecasting the market sentiment using news headlines. The prediction is based on the Dow Jones industrial average by analyzing 25 daily news headlines available between 2008 and 2016, which will then be extended up to 2020. The result will be the indicator used for developing an algorithmic trading strategy. The analysis will be performed on two specific cases that will be pursued over five time-steps and the testing will be developed in real-world scenarios.",
        "link": "https://www.semanticscholar.org/paper/c919f2a3554f64703c478201b378ef0d15cab220",
        "published": "2020",
        "pdf_url": "https://link.springer.com/content/pdf/10.1007/s00146-020-01111-x.pdf",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_119.pdf"
    },
    {
        "title": "Detecting Islamic Radicalism Arabic Tweets Using Natural Language Processing",
        "abstract": "The image of the tolerant religion of Islam has been distorted by extremists in the last two decades in many ways, such as luring teenagers into terrorist acts. Nowadays, millions of users socialize and share ideas using social media platforms such as Twitter. Typically, the ideas shared on Twitter (tweets) reach and influence many people who could simply retweet them and make them even spread faster. Unfortunately, some of these ideas are posted by extremists who share hateful Arabic content. Thus, it is very important to automate the process of controlling and monitoring hateful Arabic tweets, given that Arabic is the most widely used language in the Islamic world. In this paper, we provide a manually labeled and curated dataset of 3,000 Arabic tweets that contain hateful and non-hateful tweets. To automate the process of detecting hateful tweets, we utilize advanced Machine Learning (ML) techniques and perform sentiment analysis to capture the meaning of the Arabic words in a proper word embedding (Word2Vec). Also, we used the proposed model to classify and analyze 100,000 tweets of the last decade. The outcome of this work promotes future research on analyzing Arabic hateful speech by providing a manually labeled Arabic dataset, and the trained model (achieved 92% accuracy) which can be used as an underlying tool by governments, Internet service providers, and social media applications to detect any inflammatory tweets before they spread to a wider audience.",
        "link": "https://www.semanticscholar.org/paper/b1897dccfc4937b3edff0cd678526ad866ca1fd5",
        "published": "2022",
        "pdf_url": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/09815225.pdf",
        "pdf_path": null
    },
    {
        "title": "Conceptual Level Semantic Sentiment Analysis Using Twitter Data",
        "abstract": "Sentiment analysis (SA) AKA opinion mining is one of the frequently used Natural Language Processing (NLP) application to identify human opinions from their social media posts or reviews. Its ultimate goal is to identify the hidden emotions from their posts. The mission of SA is the classification of the opinion from the text or message. The main task of SA is to recognize and gather human opinions on various objects, topics and events. In this paper, semantic concepts are added as extra feature to the trained data set in sentiment analysis for more accurate classification of the result. We applied conceptual semantic sentiment analysis to train the three different twitter data sets. Using this notion, we can forecast the sentiment of any tweet which does not have sentiment keywords. The main emphasis is to increase the accuracy of twitter sentiment analysis by integrating the semantic analysis of words into sentiment detection.",
        "link": "https://www.semanticscholar.org/paper/f685234d6f4a1778bb77f6c035c96a88a63175c8",
        "published": "2024",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Natural Language Processing on Marketplace Product Review Sentiment Analysis",
        "abstract": "Marketplace is a platform that bridges buyer and seller to transact. In January 2020, Central Bank reported that total transactions in 14 Indonesian marketplaces reached 23.27 trillion rupiahs. At the end of the transaction process, the buyer has the opportunity to give a review of the product that has been purchased. This research aims to sentiment analysis on marketplace product reviews. This research applies Natural Language Processing as a pre-processing of text in the sentiment analysis of marketplace product reviews using a machine learning approach with the Naive Bayes and K-NN algorithms. The test scenario obtained an average Naive Bayes accuracy of 52.4% on the Unigram dataset and an average K-NN accuracy of 79.4% on the Bigram dataset. The utilization of NLP, particularly the word normalizer, can increase the accuracy of 10% for Naive Bayes and 4% for K-NN. Sentiment analysis on marketplace product reviews is useful as an opportunity for product improvement for both seller and competitor, in the other side it is also used as a reference for other users before buying a product.",
        "link": "https://www.semanticscholar.org/paper/c5c5d1d96abd187e7b164c70d212006093258dbf",
        "published": "2020",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Twitter sentiment analysis using hybrid gated attention recurrent network",
        "abstract": "Sentiment analysis is the most trending and ongoing research in the field of data mining. Nowadays, several social media platforms are developed, among that twitter is a significant tool for sharing and acquiring peoples’ opinions, emotions, views, and attitudes towards particular entities. This made sentiment analysis a fascinating process in the natural language processing (NLP) domain. Different techniques are developed for sentiment analysis, whereas there still exists a space for further enhancement in accuracy and system efficacy. An efficient and effective optimization based feature selection and deep learning based sentiment analysis is developed in the proposed architecture to fulfil it. In this work, the sentiment 140 dataset is used for analysing the performance of proposed gated attention recurrent network (GARN) architecture. Initially, the available dataset is pre-processed to clean and filter out the dataset. Then, a term weight-based feature extraction termed Log Term Frequency-based Modified Inverse Class Frequency (LTF-MICF) model is used to extract the sentiment-based features from the pre-processed data. In the third phase, a hybrid mutation-based white shark optimizer (HMWSO) is introduced for feature selection. Using the selected features, the sentiment classes, such as positive, negative, and neutral, are classified using the GARN architecture, which combines recurrent neural networks (RNN) and attention mechanisms. Finally, the performance analysis between the proposed and existing classifiers is performed. The evaluated performance metrics and the gained value for such metrics using the proposed GARN are accuracy 97.86%, precision 96.65%, recall 96.76% and f-measure 96.70%, respectively.",
        "link": "https://www.semanticscholar.org/paper/a0f90ab071830bc7356ac8d25e541d59d3287294",
        "published": "2023",
        "pdf_url": "https://journalofbigdata.springeropen.com/counter/pdf/10.1186/s40537-023-00726-3",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_123.pdf"
    },
    {
        "title": "Automated Disaster Monitoring From Social Media Posts Using AI-Based Location Intelligence and Sentiment Analysis",
        "abstract": "Worldwide disasters like bushfires, earthquakes, floods, cyclones, and heatwaves have affected the lives of social media users in an unprecedented manner. They are constantly posting their level of negativity over the disaster situations at their location of interest. Understanding location-oriented sentiments about disaster situation is of prime importance for political leaders, and strategic decision-makers. To this end, we present a new fully automated algorithm based on artificial intelligence (AI) and natural language processing (NLP), for extraction of location-oriented public sentiments on global disaster situation. We designed the proposed system to obtain exhaustive knowledge and insights on social media feeds related to disaster in 110 languages through AI- and NLP-based sentiment analysis, named entity recognition (NER), anomaly detection, regression, and Getis Ord Gi* algorithms. We deployed and tested this algorithm on live Twitter feeds from 28 September to 6 October 2021. Tweets with 67 515 entities in 39 different languages were processed during this period. Our novel algorithm extracted 9727 location entities with greater than 70% confidence from live Twitter feed and displayed the locations of possible disasters with disaster intelligence. The rates of average precision, recall, and $F_{1}$ -Score were measured to be 0.93, 0.88, and 0.90, respectively. Overall, the fully automated disaster monitoring solution demonstrated 97% accuracy. To the best of our knowledge, this study is the first to report location intelligence with NER, sentiment analysis, regression and anomaly detection on social media messages related to disasters and has covered the largest set of languages.",
        "link": "https://www.semanticscholar.org/paper/fce1feda139e2d60d03174f2914bd867d9d969eb",
        "published": "2024",
        "pdf_url": "https://www.techrxiv.org/articles/preprint/Automated_Disaster_Monitoring_from_Social_Media_Posts_using_AI_based_Location_Intelligence_and_Sentiment_Analysis/19212105/1/files/34130787.pdf",
        "pdf_path": null
    },
    {
        "title": "Analyzing mass media influence using natural language processing and time series analysis",
        "abstract": "A key question of collective social behavior is related to the influence of mass media on public opinion. Different approaches have been developed to address quantitatively this issue, ranging from field experiments to mathematical models. In this work we propose a combination of tools involving natural language processing and time series analysis. We compare selected features of mass media news articles with measurable manifestation of public opinion. We apply our analysis to news articles belonging to the 2016 US presidential campaign. We compare variations in polls (as a proxy of public opinion) with changes in the connotation of the news (sentiment) or in the agenda (topics) of a selected group of media outlets. Our results suggest that the sentiment content by itself is not enough to understand the differences in polls, but the combination of topics coverage and sentiment content provides an useful insight of the context in which public opinion varies. The methodology employed in this work is far general and can be easily extended to other topics of interest.",
        "link": "https://www.semanticscholar.org/paper/406c310a4902c87fe7e8f7df36f6118f4f580e9e",
        "published": "2019",
        "pdf_url": "https://iopscience.iop.org/article/10.1088/2632-072X/ab8784/pdf",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_125.pdf"
    },
    {
        "title": "Academic Dishonesty or Academic Integrity? Using Natural Language Processing (NLP) Techniques to Investigate Positive Integrity in Academic Integrity Research",
        "abstract": "Is academic integrity research presented from a positive integrity standpoint? This paper uses Natural Language Processing (NLP) techniques to explore a data set of 8,507 academic integrity papers published between 1904 and 2019. Two main techniques are used to linguistically examine paper titles: (1) bigram (word pair) analysis and (2) sentiment analysis. The analysis sees the three main bigrams used in paper titles as being “academic integrity” (2.38%), “academic dishonesty” (2.06%) and “plagiarism detection” (1.05%). When only highly cited papers are considered, negative integrity bigrams dominate positive integrity bigrams. For example, the 100 most cited academic integrity papers of all time are three times more likely to have “academic dishonesty” included in their titles than “academic integrity”. Similarly, sentiment analysis sees negative sentiment outperforming positive sentiment in the most cited papers. The history of academic integrity research is seen to place the field at a disadvantage due to negative portrayals of integrity. Despite this, analysis shows that change towards positive integrity is possible. The titles of papers by the ten most prolific academic integrity researchers are found to use positive terminology in more cases that not. This suggests an approach for emerging academic integrity researchers to model themselves after.",
        "link": "https://www.semanticscholar.org/paper/1d8226980da76fcd8fd565a4a66452d59ea6d8e5",
        "published": "2021",
        "pdf_url": "https://link.springer.com/content/pdf/10.1007/s10805-021-09422-4.pdf",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_126.pdf"
    },
    {
        "title": "Large Language Model Adaptation for Financial Sentiment Analysis",
        "abstract": "Natural language processing (NLP) has recently gained relevance within financial institutions by providing highly valuable insights into companies and markets' financial documents. However, the landscape of the financial domain presents extra challenges for NLP, due to the complexity of the texts and the use of specific terminology. Generalist language models tend to fall short in tasks specifically tailored for finance, even when using large language models (LLMs) with great natural language understanding and generative capabilities. This paper presents a study on LLM adaptation methods targeted at the financial domain and with high emphasis on financial sentiment analysis. To this purpose, two foundation models with less than 1.5B parameters have been adapted using a wide range of strategies. We show that through careful fine-tuning on both financial documents and instructions, these foundation models can be adapted to the target domain. Moreover, we observe that small LLMs have comparable performance to larger scale models, while being more efficient in terms of parameters and data. In addition to the models, we show how to generate artificial instructions through LLMs to augment the number of samples of the instruction dataset.",
        "link": "https://www.semanticscholar.org/paper/4bbc278bc27a399bda7bc3015d2f38bd34f8dff7",
        "published": "2024",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Boosting Delirium Identification Accuracy With Sentiment-Based Natural Language Processing: Mixed Methods Study",
        "abstract": "Background Delirium is an acute neurocognitive disorder that affects up to half of older hospitalized medical patients and can lead to dementia, longer hospital stays, increased health costs, and death. Although delirium can be prevented and treated, it is difficult to identify and predict. Objective This study aimed to improve machine learning models that retrospectively identify the presence of delirium during hospital stays (eg, to measure the effectiveness of delirium prevention interventions) by using the natural language processing (NLP) technique of sentiment analysis (in this case a feature that identifies sentiment toward, or away from, a delirium diagnosis). Methods Using data from the General Medicine Inpatient Initiative, a Canadian hospital data and analytics network, a detailed manual review of medical records was conducted from nearly 4000 admissions at 6 Toronto area hospitals. Furthermore, 25.74% (994/3862) of the eligible hospital admissions were labeled as having delirium. Using the data set collected from this study, we developed machine learning models with, and without, the benefit of NLP methods applied to diagnostic imaging reports, and we asked the question “can NLP improve machine learning identification of delirium?” Results Among the eligible 3862 hospital admissions, 994 (25.74%) admissions were labeled as having delirium. Identification and calibration of the models were satisfactory. The accuracy and area under the receiver operating characteristic curve of the main model with NLP in the independent testing data set were 0.807 and 0.930, respectively. The accuracy and area under the receiver operating characteristic curve of the main model without NLP in the independent testing data set were 0.811 and 0.869, respectively. Model performance was also found to be stable over the 5-year period used in the experiment, with identification for a likely future holdout test set being no worse than identification for retrospective holdout test sets. Conclusions Our machine learning model that included NLP (ie, sentiment analysis in medical image description text mining) produced valid identification of delirium with the sentiment analysis, providing significant additional benefit over the model without NLP.",
        "link": "https://www.semanticscholar.org/paper/d09d7e77c135d3d59b430bb162f80b6e8156f3fe",
        "published": "2022",
        "pdf_url": "https://medinform.jmir.org/2022/12/e38161/PDF",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_128.pdf"
    },
    {
        "title": "Tunisian Dialect Sentiment Analysis: A Natural Language Processing-based Approach",
        "abstract": "Social media platforms have been witnessing a significant increase in posts written in the Tunisian dialect since the uprising in Tunisia at the end of 2010. Most of the posted tweets or comments reflect the impressions of the Tunisian public towards social, economical and political major events. These opinions have been tracked, analyzed and evaluated through sentiment analysis systems. In the current study, we investigate the impact of several preprocessing techniques on sentiment analysis using two sentiment classification models: Supervised and lexicon-based. These models were trained on three Tunisian datasets of different sizes and multiple domains. Our results emphasize the positive impact of preprocessing phase on the evaluation measures of both sentiment classifiers as the baseline was significantly outperformed when stemming, emoji recognition and negation detection tasks were applied. Moreover, integrating named entities with these tasks enhanced the lexicon-based classification performance in all datasets and that of the supervised model in medium and small sized datasets.",
        "link": "https://www.semanticscholar.org/paper/2ac792d435a00487f2a610584b1fc6662f8fbd2a",
        "published": "2018",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Analyzing user-generated content using natural language processing: a case study of public satisfaction with healthcare systems",
        "abstract": "While user-generated online content (UGC) is increasingly available, public opinion studies are yet to fully exploit the abundance and richness of online data. This study contributes to the practical knowledge of user-generated online content and machine learning techniques that can be used for the analysis of UGC. For this purpose, we explore the potential of user-generated content and present an application of natural language pre-processing, text mining and sentiment analysis to the question of public satisfaction with healthcare systems. Concretely, we analyze 634 online comments reflecting attitudes towards healthcare services in different countries. Our analysis identifies the frequency of topics related to healthcare services in textual content of the comments and attempts to classify and rank national healthcare systems based on the respondents’ sentiment scores. In this paper, we describe our approach, summarize our main findings, and compare them with the results from cross-national surveys. Finally, we outline the typical limitations inherent in the analysis of user-generated online content and suggest avenues for future research.",
        "link": "https://www.semanticscholar.org/paper/a28b4c54b5aa761e3611089f7384ce3ce591c7d6",
        "published": "2021",
        "pdf_url": "https://link.springer.com/content/pdf/10.1007/s42001-021-00148-2.pdf",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_130.pdf"
    },
    {
        "title": "Multilingual Sentiment Analysis using Deep-Learning Architectures",
        "abstract": "Machine learning techniques such as NLP (Natural language processing) play a key role in a context where mining social media data could add great value to governments of the world countries. The posts and tweets shared by the people on social media can be mined to infer the valuable ‘mindset’ of the people which is much required for any ruling government in the world. The objective of this study is to conduct sentiment analysis to mine the sentiment of the people regarding the ongoing war between Russia and Ukraine, using machine learning techniques. The idea is to analyze and infer if the countries have reacted in some way, considering the sentiment of their citizens, in the context of economic effects. The pipeline of the implementation associated starts with the data collection from social media such as Twitter and Reddit using Snscraper and the PRAW (Python Reddit API Wrapper). The larger posts from Reddit are handled by implementing suitable text summarization techniques. Sentiment analysis is performed for the social media data using the BERT transformer model. The non-English posts are translated to English using neural machine translation. Also, sentiment analysis is performed at various granularities such as the location and the people that are tagged using Named Entity Recognition techniques. Finally, a comparative analysis of the world countries’ sentiment and their corresponding reliance on Russian oil is performed.",
        "link": "https://www.semanticscholar.org/paper/38f49d4540825f0d744e453e668ec60e5e082d4b",
        "published": "2023",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Neuromorphic Sentiment Analysis Using Spiking Neural Networks",
        "abstract": "Over the past decade, the artificial neural networks domain has seen a considerable embracement of deep neural networks among many applications. However, deep neural networks are typically computationally complex and consume high power, hindering their applicability for resource-constrained applications, such as self-driving vehicles, drones, and robotics. Spiking neural networks, often employed to bridge the gap between machine learning and neuroscience fields, are considered a promising solution for resource-constrained applications. Since deploying spiking neural networks on traditional von-Newman architectures requires significant processing time and high power, typically, neuromorphic hardware is created to execute spiking neural networks. The objective of neuromorphic devices is to mimic the distinctive functionalities of the human brain in terms of energy efficiency, computational power, and robust learning. Furthermore, natural language processing, a machine learning technique, has been widely utilized to aid machines in comprehending human language. However, natural language processing techniques cannot also be deployed efficiently on traditional computing platforms. In this research work, we strive to enhance the natural language processing traits/abilities by harnessing and integrating the SNNs traits, as well as deploying the integrated solution on neuromorphic hardware, efficiently and effectively. To facilitate this endeavor, we propose a novel, unique, and efficient sentiment analysis model created using a large-scale SNN model on SpiNNaker neuromorphic hardware that responds to user inputs. SpiNNaker neuromorphic hardware typically can simulate large spiking neural networks in real time and consumes low power. We initially create an artificial neural networks model, and then train the model using an Internet Movie Database (IMDB) dataset. Next, the pre-trained artificial neural networks model is converted into our proposed spiking neural networks model, called a spiking sentiment analysis (SSA) model. Our SSA model using SpiNNaker, called SSA-SpiNNaker, is created in such a way to respond to user inputs with a positive or negative response. Our proposed SSA-SpiNNaker model achieves 100% accuracy and only consumes 3970 Joules of energy, while processing around 10,000 words and predicting a positive/negative review. Our experimental results and analysis demonstrate that by leveraging the parallel and distributed capabilities of SpiNNaker, our proposed SSA-SpiNNaker model achieves better performance compared to artificial neural networks models. Our investigation into existing works revealed that no similar models exist in the published literature, demonstrating the uniqueness of our proposed model. Our proposed work would offer a synergy between SNNs and NLP within the neuromorphic computing domain, in order to address many challenges in this domain, including computational complexity and power consumption. Our proposed model would not only enhance the capabilities of sentiment analysis but also contribute to the advancement of brain-inspired computing. Our proposed model could be utilized in other resource-constrained and low-power applications, such as robotics, autonomous, and smart systems.",
        "link": "https://www.semanticscholar.org/paper/65004f44a0095bccc673d76e5dbe7880385fde97",
        "published": "2023",
        "pdf_url": "https://www.mdpi.com/1424-8220/23/18/7701/pdf?version=1694004128",
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis Using VADER and Logistic Regression Techniques",
        "abstract": "A prominent subject named sentiment analysis in natural language processing aims to detect the sentiment or emotion contained in a text This paper aims to compare the efficacy of two approaches in order to analyze sentiment: VADER and logistic regression. VADER is a lexicon-based method that uses a predefined set of guidelines to analyze the sentiment of a text, while Logistic Regression is a machine learning-based approach that relies on training data to learn how to classify the sentiment of a text. To evaluate the performance of these approaches, they were applied to a dataset of tweets about airlines and compared the results in terms of accuracy. The results showed that Logistic Regression outperformed VADER on this dataset, achieving an accuracy of 79%. These results suggest that Logistic Regression may be a more effective approach for sentiment analysis in the context of airline tweets.",
        "link": "https://www.semanticscholar.org/paper/3a47fe84c399f8e7fd623ea0a26bde1989ecdd1a",
        "published": "2023",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Transfer Learning for Sentiment Analysis Using BERT Based Supervised Fine-Tuning",
        "abstract": "The growth of the Internet has expanded the amount of data expressed by users across multiple platforms. The availability of these different worldviews and individuals’ emotions empowers sentiment analysis. However, sentiment analysis becomes even more challenging due to a scarcity of standardized labeled data in the Bangla NLP domain. The majority of the existing Bangla research has relied on models of deep learning that significantly focus on context-independent word embeddings, such as Word2Vec, GloVe, and fastText, in which each word has a fixed representation irrespective of its context. Meanwhile, context-based pre-trained language models such as BERT have recently revolutionized the state of natural language processing. In this work, we utilized BERT’s transfer learning ability to a deep integrated model CNN-BiLSTM for enhanced performance of decision-making in sentiment analysis. In addition, we also introduced the ability of transfer learning to classical machine learning algorithms for the performance comparison of CNN-BiLSTM. Additionally, we explore various word embedding techniques, such as Word2Vec, GloVe, and fastText, and compare their performance to the BERT transfer learning strategy. As a result, we have shown a state-of-the-art binary classification performance for Bangla sentiment analysis that significantly outperforms all embedding and algorithms.",
        "link": "https://www.semanticscholar.org/paper/212ad044aec57eec03984ef70bc6eb628825f599",
        "published": "2022",
        "pdf_url": "https://www.mdpi.com/1424-8220/22/11/4157/pdf?version=1653914411",
        "pdf_path": null
    },
    {
        "title": "Sentiment analysis of movie reviews based on NB approaches using TF–IDF and count vectorizer",
        "abstract": null,
        "link": "https://www.semanticscholar.org/paper/5be74762e74f4207b114812ebf444f2d8c465cb1",
        "published": "2024",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Deep Sentiment Analysis Using CNN-LSTM Architecture of English and Roman Urdu Text Shared in Social Media",
        "abstract": "Sentiment analysis (SA) has been an active research subject in the domain of natural language processing due to its important functions in interpreting people’s perspectives and drawing successful opinion-based judgments. On social media, Roman Urdu is one of the most extensively utilized dialects. Sentiment analysis of Roman Urdu is difficult due to its morphological complexities and varied dialects. The purpose of this paper is to evaluate the performance of various word embeddings for Roman Urdu and English dialects using the CNN-LSTM architecture with traditional machine learning classifiers. We introduce a novel deep learning architecture for Roman Urdu and English dialect SA based on two layers: LSTM for long-term dependency preservation and a one-layer CNN model for local feature extraction. To obtain the final classification, the feature maps learned by CNN and LSTM are fed to several machine learning classifiers. Various word embedding models support this concept. Extensive tests on four corpora show that the proposed model performs exceptionally well in Roman Urdu and English text sentiment classification, with an accuracy of 0.904, 0.841, 0.740, and 0.748 against MDPI, RUSA, RUSA-19, and UCL datasets, respectively. The results show that the SVM classifier and the Word2Vec CBOW (Continuous Bag of Words) model are more beneficial options for Roman Urdu sentiment analysis, but that BERT word embedding, two-layer LSTM, and SVM as a classifier function are more suitable options for English language sentiment analysis. The suggested model outperforms existing well-known advanced models on relevant corpora, improving the accuracy by up to 5%.",
        "link": "https://www.semanticscholar.org/paper/b52958224f11c5a3940ef44228f0008ed3df66b0",
        "published": "2022",
        "pdf_url": "https://www.mdpi.com/2076-3417/12/5/2694/pdf?version=1646749336",
        "pdf_path": null
    },
    {
        "title": "Exploring Zero-shot Cross-lingual Aspect-based Sentiment Analysis using Pre-trained Multilingual Language Models",
        "abstract": "Aspect-based sentiment analysis (ABSA) has received much attention in the Natural Language Processing research community. Most of the proposed methods are conducted exclusively in English and high-resources languages. Leveraging resources available from English and transferring to low-resources languages seems to be an immediate solution. In this paper, we investigate the performance of zero-shot cross-lingual transfer learning based on pre-trained multilingual models (mBERT and XLM-R) for two main sub-tasks in the ABSA problem: Aspect Category Detection and Opinion Target Expression. We experiment on the benchmark data sets of six languages as English, Russian, Dutch, Spanish, Turkish, and French. The experimental results demonstrated that using the XLM-R model can yield relatively acceptable results for the zero-shot cross-lingual scenario.",
        "link": "https://www.semanticscholar.org/paper/e06af2465da0f73bb62bd2cd4da43b158efab9d8",
        "published": "2021",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "A deep learning-based model using hybrid feature extraction approach for consumer sentiment analysis",
        "abstract": "There is an exponential growth in textual content generation every day in today's world. In-app messaging such as Telegram and WhatsApp, social media websites such as Instagram and Facebook, e-commerce websites like Amazon, Google searches, news publishing websites, and a variety of additional sources are the possible suppliers. Every instant, all these sources produce massive amounts of text data. The interpretation of such data can help business owners analyze the social outlook of their product, brand, or service and take necessary steps. The development of a consumer review summarization model using Natural Language Processing (NLP) techniques and Long short-term memory (LSTM) to present summarized data and help businesses obtain substantial insights into their consumers' behavior and choices is the topic of this research. A hybrid approach for analyzing sentiments is presented in this paper. The process comprises pre-processing, feature extraction, and sentiment classification. Using NLP techniques, the pre-processing stage eliminates the undesirable data from input text reviews. For extracting the features effectively, a hybrid method comprising review-related features and aspect-related features has been introduced for constructing the distinctive hybrid feature vector corresponding to each review. The sentiment classification is performed using the deep learning classifier LSTM. We experimentally evaluated the proposed model using three different research datasets. The model achieves the average precision, average recall, and average F1-score of 94.46%, 91.63%, and 92.81%, respectively.",
        "link": "https://www.semanticscholar.org/paper/f0de3b77ad0da2738766e66392dbd370122bfec8",
        "published": "2023",
        "pdf_url": "https://journalofbigdata.springeropen.com/counter/pdf/10.1186/s40537-022-00680-6",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_138.pdf"
    },
    {
        "title": "Statistical Natural Language Processing for Sentiment Analysis",
        "abstract": null,
        "link": "https://www.semanticscholar.org/paper/4624c0825ae1f278dd349e3cc5a7b50f52bba18b",
        "published": "2017",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis Using Language Models: A Study",
        "abstract": "Sentiment analysis is concerned with extracting sentiment to ascertain the attitudes, and emotions associated with the text. It is broadly applied to voice of the customer as they convey their experience and feelings more blatantly which is why comprehending customer’s emotions is a must. To identify and classify these unstructured emotions natural language processing (NLP) and machine learning approaches have been adopted in recent times. The main issue with the existing techniques is the inability to deal with the correct interpretation of context owing to lack of labeled data. In this paper, we studied deep neural network based language models to interpret and classify textual sequences into positive, negative or neutral emotions which remove the bottleneck of explicit human labeling. These models were analyzed and evaluations were performed on the Twitter US Airline Sentiment dataset. We have observed a considerable amount of improvements with respect to prior state-of-the-art approaches which closes the gap with supervised feature learning.",
        "link": "https://www.semanticscholar.org/paper/5a7981e317557acde0c96e7346068cad10782f5c",
        "published": "2021",
        "pdf_url": "",
        "pdf_path": null
    },
    {
        "title": "Predicting Indian Stock Prices by Using Sentiment Analysis and Natural Language Processing",
        "abstract": "",
        "link": "https://doi.org/10.52783/eel.v15i1.2670",
        "published": "2025-3-6",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sarcasm detection using deep learning in natural language processing",
        "abstract": "",
        "link": "https://doi.org/10.1016/b978-0-443-22009-8.00013-6",
        "published": "2024-2-2",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis of Stock Portfolios Using Financial News Data and Natural Language Processing",
        "abstract": "",
        "link": "https://doi.org/10.2139/ssrn.4974475",
        "published": "2024-11-11",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Svs-Iadaboost: Sentiment Analysis of Social Media Data Using Natural Language Processing",
        "abstract": "",
        "link": "https://doi.org/10.2139/ssrn.5335572",
        "published": "2025-7-2",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Optimizing Natural Language Processing Applications for Sentiment Analysis",
        "abstract": "",
        "link": "https://doi.org/10.5220/0012632000003690",
        "published": "2024-5-2",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Implementation of sentiment analysis in stock market prediction using variants of GARCH models",
        "abstract": "",
        "link": "https://doi.org/10.1016/b978-0-443-22009-8.00002-1",
        "published": "2024-2-2",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis Using Natural Language Processing",
        "abstract": "",
        "link": "https://doi.org/10.1002/9781394272464.ch20",
        "published": "2025-1-10",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment analysis of Bangla language using a new comprehensive dataset BangDSA and the novel feature metric skipBangla-BERT",
        "abstract": "",
        "link": "https://doi.org/10.1016/j.nlp.2024.100069",
        "published": "2024-4-16",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Analyzing public sentiment on sustainability: A comprehensive review and application of sentiment analysis techniques",
        "abstract": "",
        "link": "https://doi.org/10.1016/j.nlp.2024.100097",
        "published": "2024-8-10",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "SENTIMENT ANALYSIS FOR CUSTOMER REVIEWS USING NATURAL LANGUAGE PROCESSING",
        "abstract": "",
        "link": "https://doi.org/10.56726/irjmets82202",
        "published": "2025-8-26",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Computational Intelligence Methods for Sentiment Analysis in Natural Language Processing Applications",
        "abstract": "",
        "link": "https://doi.org/10.1016/c2022-0-02821-x",
        "published": "2024-2-2",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Applying Natural Language Processing for Stock Investors Sentiment Analysis",
        "abstract": "",
        "link": "https://doi.org/10.1201/9781032618241-14",
        "published": "2024-10-21",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Cryptocurrency Price Prediction using Twitter Sentiment Analysis",
        "abstract": "<jats:p>The cryptocurrency ecosystem has been the centre of discussion on many social media platforms, following its noted volatility and varied opinions. Twitter is rapidly being utilised as a news source and a medium for bitcoin discussion. Our algorithm seeks to use historical prices and sentiment of tweets to forecast the price of Bitcoin. In this study, we develop an end-to-end model that can forecast the sentiment of a set of tweets (using a Bidirectional Encoder Representations from Transformers - based Neural Network Model) and forecast the price of Bitcoin (using Gated Recurrent Unit) using the predicted sentiment and other metrics like historical cryptocurrency price data, tweet volume, a user's following, and whether or not a user is verified. The sentiment prediction gave a Mean Absolute Percentage Error of 9.45%, an average of real-time data, and test data. The mean absolute percent error for the price prediction was 3.6%.</jats:p>",
        "link": "https://doi.org/10.5121/csit.2023.130302",
        "published": "2023-2-27",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "BOARD #56A: Student Feedback Analysis Using Natural Language Processing (NLP) and Sentiment Analysis",
        "abstract": "",
        "link": "https://doi.org/10.18260/1-2--56002",
        "published": "2025-8-21",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Optimization of effectual sentiment analysis in film reviews using machine learning techniques",
        "abstract": "",
        "link": "https://doi.org/10.1016/b978-0-443-22009-8.00003-3",
        "published": "2024-2-2",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis and Subjectivity Bing Liu",
        "abstract": "",
        "link": "https://doi.org/10.1201/9781420085938-36",
        "published": "2020-7-9",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Improving aspect-based sentiment analysis with contrastive learning",
        "abstract": "",
        "link": "https://doi.org/10.1016/j.nlp.2023.100009",
        "published": "2023-5-5",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment analysis",
        "abstract": "",
        "link": "https://doi.org/10.1145/945649.945658",
        "published": "2004-2-4",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Copyright",
        "abstract": "",
        "link": "https://doi.org/10.1016/b978-0-443-22009-8.00017-3",
        "published": "2024-2-2",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Natural Language Processing Techniques for Sentiment Analysis in Social Media",
        "abstract": "<p>Natural Language Processing Techniques for Sentiment Analysis inSocial Media</p>",
        "link": "https://doi.org/10.31219/osf.io/qgdbz",
        "published": "2023-5-15",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Cross Lingual Sentiment Analysis using Modified BRAE",
        "abstract": "",
        "link": "https://doi.org/10.18653/v1/d15-1016",
        "published": "2015-12-15",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Twitter Sentiment Analysis using Natural Language Processing",
        "abstract": "",
        "link": "https://doi.org/10.1109/iccica52458.2021.9697136",
        "published": "2022-2-7",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis Using Natural Language Processing",
        "abstract": "<jats:p>In this research, Our initial efforts on text based sentiment detection of tweets are presented in this publication. The\nmotive of this experiment is to extract sentiment from tweets by using subjects that are present in them. Using methods from\nNatural Language Processing(NLP), it determines the sentiment that relevant to the specific topic. The subjective aspect\nclassification, semantic connection, and polarity categorization are the three primary processes in our experiment that are used\nto classify sentiment. By establishing experiment uses sentiment lexical terms to determine the grammatical relationship between\nsubject matter and sentiment lexicons.\nThe suggested approach outperforms the existing text sentiment analysis technologies, according to experimental data, because\ntweets' structure differs from that of conventional text. The categorization of emotions in textual data is known as sentiment\nanalysis, sometimes called opinion mining or emotion extraction. This approach has been widely used over time to pinpoint the\nfeelings and ideas present in a particular textual information set. People mostly use Twitter as a means of social media to\ncommunicate their feelings on specific events. In this study, we gathered tweets for different occurrences, evaluated them using\nseveral automated learning methods, including LSTM, the Random Forest classifier, SVM, and Naïve Bays, and compared the\noutcomes.</jats:p>",
        "link": "https://doi.org/10.22214/ijraset.2025.71246",
        "published": "2025-5-22",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis in Turkish",
        "abstract": "",
        "link": "https://doi.org/10.1007/978-3-319-90165-7_12",
        "published": "2018-7-20",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Contents",
        "abstract": "",
        "link": "https://doi.org/10.1016/b978-0-443-22009-8.00018-5",
        "published": "2024-2-2",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Approaches of Classification Models for Sentiment Analysis",
        "abstract": "<jats:p>Sentiment analysis (SA) is a Natural Language Processing (NLP) method that helps identify the emotions in text. It is the automated process of identifying and classifying emotions in a text as positive, negative, or neutral sentiment. This way, companies can understand customers’ sentiments, improve their products and services accordingly, and determine effective strategies. The need to discover the algorithm with the best classification performance is obvious. To this end, two different approaches for Sentiment Analysis problems are presented. The first one is based on Machine Learning (ML) models and the second one on Deep Learning (DP) models. Most ML models are flexible depending on their classifier hyperparameters and provide competitive accuracy levels but not all of them. Logistic Regression (LR), Random Forests (RF) of ML and the various models based on Neural Networks (NNs) of DL are applied. Useful results are obtained. Measures for classifiers’ effectiveness are also provided.</jats:p>",
        "link": "https://doi.org/10.5121/csit.2024.141007",
        "published": "2024-6-30",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis for Visuals using Natural Language Processing",
        "abstract": "",
        "link": "https://doi.org/10.5120/ijca2015906581",
        "published": "2015-10-15",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis Of Tweets Using Natural Language Processing",
        "abstract": "",
        "link": "https://doi.org/10.36287/ijmsit.6.1.58",
        "published": "2022-7-20",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Classification of advertisement articles using sentiment analysis",
        "abstract": "",
        "link": "https://doi.org/10.1145/3582768.3582800",
        "published": "2023-6-27",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis",
        "abstract": "",
        "link": "https://doi.org/10.1007/978-981-97-9739-4_10",
        "published": "2025-3-11",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Implementing a Drilling Reporting Data Mining Tool Using Natural Language Processing Sentiment Analysis Techniques",
        "abstract": "<jats:title>Abstract</jats:title>\n               <jats:p>Drilling operations generate much information, such as daily drilling reports and reports generated by service companies, support personnel, and other stakeholders. These reports can be unstructured with information presented in a variety of formats. The extraction of this information is frequently challenging, which limits its use in future projects. Natural language processing provides an efficient way of mining and obtaining knowledge. This paper demonstrates how these techniques were used to analyze vast amounts of historical documents to quickly rank well complexity and determine which aspects of drilling operations were most critical.</jats:p>\n               <jats:p>Sentiment analysis can be used to classify documents and other pieces of information into separate categories. In social media, it is used to analyze the collective perception of a given trending item. The technique was used here to classify wells into two ranked categorized lists. First, a classification listed wells by drilling issues. Second, a complexity ranking was defined so that each well could be classified as easy or difficult to drill. To build the sentiment analysis tool, a random set of training wells and their respective documents were selected. From these documents, a list of words was identified in what became known as highlighting sessions. During these sessions, subject matter experts (SMEs) classified words found in the documents. This \"bag of words\" was then used to train a classifier capable of ranking the wells related to the documents. A probability was associated to each well, providing a likelihood of inclusion in a given category.</jats:p>\n               <jats:p>The methodology proved to be successful, ranking drilling documents in both defined category sets. Results show that the list of ranked wells can be used by SMEs to identify which wells are relevant and deserve detailed analysis. The list generated for both categories provided a guideline for further analysis, particularly identifying wells with little value. Results also showed the importance of correctly developing a list of words, an adequate training set, and the language used, as well as the need for SMEs to produce the final analysis. The technology showed promising results with real-world applications being conceivable with its current level of maturity. However, the results also indicated room for improving its effectiveness by refining the highlighting sessions, word lists, types of classifier used, and final ranking methodology.</jats:p>\n               <jats:p>The use of methods and technology to help improve and enable the analysis of unstructured data in the drilling space should increase over time. This paper shows how current technology can already be used in practical real-life cases to produce tangible value.</jats:p>",
        "link": "https://doi.org/10.2118/194961-ms",
        "published": "2019-3-13",
        "pdf_url": "https://onepetro.org/SPEMEOS/proceedings-pdf/doi/10.2118/194961-MS/4028927/spe-194961-ms.pdf",
        "pdf_path": null
    },
    {
        "title": "An Exploratory Content and Sentiment Analysis of The Guardian Metaverse Articles Using Leximancer and Natural Language Processing",
        "abstract": "<jats:title>Abstract</jats:title>\n        <jats:p>The metaverse has become one of the most popular concepts of recent times. Companies and entrepreneurs are fiercely competing to invest and take part in this virtual world. Millions of people globally are anticipated to spend much of their time in the metaverse, regardless of their age, gender, ethnicity, or culture. There are few comprehensive studies on the positive/negative sentiment and effect of the newly identified, but not well defined, metaverse concept that is already fast evolving the digital landscape. Thereby, this study aimed to better understand the metaverse concept, by, firstly, identifying the positive and negative sentiment characteristics and, secondly, by revealing the associations between the metaverse concept and other related concepts. To do so, this study used Natural Language Processing (NLP) methods, specifically Artificial Intelligence (AI) with computational qualitative analysis. The data comprised metaverse articles from 2021–2022 published on The Guardian website, a key global mainstream media outlet. To perform thematic content analysis of the qualitative data, this research used the Leximancer software, and the The Natural Language Toolkit (NLTK) from NLP libraries were used to identify sentiment. Further, an AI-based Monkeylearn API was used to make sectoral classifications of the main topics that emerged in the Leximancer analysis. The key themes which emerged in the Leximancer analysis, included \"metaverse\", \"Facebook\", \"games\" and \"platforms\". The sentiment analysis revealed that of all articles published in the period of 2021–2022 about the metaverse, 61% (n = 622) were positive, 30% (n = 311) were negative, and 9% (n = 90) were neutral. Positive discourses about the metaverse were found to concern key innovations that the virtual experiences brought to users and companies with the support of the technological infrastructure of blockchain, algorithms, NFTs, led by the gaming world. Negative discourse was found to evidence various problems (misinformation, harmful content, algorithms, data, and equipment) that occur during the use of Facebook and other social media platforms, and that individuals encountered harm in the metaverse or that the metaverse produces new problems. Monkeylearn findings revealed “marketing/advertising/PR” role, “Recreational” business, “Science &amp; Technology” events as the key content topics. This study’s contribution is twofold: first, it showcases a novel way to triangulate qualitative data analysis of large unstructured textual data as a method in exploring the metaverse concept; and second, the study reveals the characteristics of the metaverse as a concept, as well as its association with other related concepts. Given that the topic of the metaverse is new, this is the first study, to our knowledge, to do both.</jats:p>",
        "link": "https://doi.org/10.21203/rs.3.rs-1882606/v1",
        "published": "2022-7-29",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment analysis",
        "abstract": "",
        "link": "https://doi.org/10.1145/945645.945658",
        "published": "2004-4-19",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Index",
        "abstract": "",
        "link": "https://doi.org/10.1016/b978-0-443-22009-8.00020-3",
        "published": "2024-2-2",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "A Framework for Youth Sentiment Analysis Using Natural Language Processing",
        "abstract": "",
        "link": "https://doi.org/10.12720/jait.14.6.1331-1338",
        "published": "2023-12-7",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "A Translanguaging Turn in Sentiment Analysis: Exploring the Role of Language, Culture, and Linguistics in Natural Language Processing",
        "abstract": "<jats:p>Sentiment analysis has witnessed significant advancements particularly in a translanguaging paradigm, emphasizing the entanglement of different languages, modalities, and cultures. This article provides an overview of the translanguaging advances in sentiment analysis, covering techniques, applications, and challenges. The article begins by briefly introducing the major trends of sentiment analysis, highlighting its current importance in understanding and analyzing human emotions and opinions expressed in data. It then delves into the edge-cutting techniques employed in sentiment analysis. Afterwards, the emerging application domains were explored through CiteSpace 5.7.R5. Despite the achievements made in sentiment analysis, numerous challenges persist. The last part of this article presents the challenges and researchers’ attempted solutions, which accentuates the need for robust techniques to improve the accuracy and reliability of sentiment analysis.</jats:p>",
        "link": "https://doi.org/10.7763/ijet.2023.v15.1243",
        "published": "2023-11-7",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis of Customer Reviews Using Natural Language Processing",
        "abstract": "",
        "link": "https://doi.org/10.61137/ijsret.vol.10.issue5.250",
        "published": "2024-10-4",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Real Time Twitter Sentiment Analysis using Natural Language Processing",
        "abstract": "",
        "link": "https://doi.org/10.17577/ijertv9is070406",
        "published": "2020-7-29",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Title page",
        "abstract": "",
        "link": "https://doi.org/10.1016/b978-0-443-22009-8.00021-5",
        "published": "2024-2-2",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Financial sentiment analysis for pre-trained language models incorporating dictionary knowledge and neutral features",
        "abstract": "",
        "link": "https://doi.org/10.1016/j.nlp.2025.100148",
        "published": "2025-4-23",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment analysis and natural language processing using Reddit data to evaluate patient opinions on hair loss therapeutics (Preprint)",
        "abstract": "<sec>\n                    <title>BACKGROUND</title>\n                        <p>Online forums are rich sources of user-derived data and harnessing this information utilizing natural language processing techniques can provide insights into patient experiences. The subject forums of Reddit may allow for focused explorations such as opinions on specific therapeutic agents.</p>\n                </sec>\n                                <sec>\n                    <title>OBJECTIVE</title>\n                        <p>To determine patient sentiment about key treatments for female hair loss. Secondarily, to demonstrate the feasibility of using Reddit data to perform sentiment analysis on patient comments.</p>\n                </sec>\n                                <sec>\n                    <title>METHODS</title>\n                        <p>A software pipeline scraped publicly available Reddit comments from r/femalehairloss, then processed them into sentence tokens. Sentiment analysis was subsequently performed. A frequency word representation was created.</p>\n                </sec>\n                                <sec>\n                    <title>RESULTS</title>\n                        <p>The most frequently cited single treatments were minoxidil and spironolactone. Comments mentioning PRP and minoxidil were the second and third most positive on average. Comments referencing dutasteride were the most positive, however, this may be skewed by the low number of dutasteride-only comments. Finasteride comments were the least positive on average but were still slightly greater than 0.</p>\n                </sec>\n                                <sec>\n                    <title>CONCLUSIONS</title>\n                        <p>In this paper, we have demonstrated the feasibility of performing sentiment analysis on Reddit comments. Our results suggest that opinions about hair loss therapeutics on the examined forum were on average positive. Analysis of health-focused subreddits such as r/femalehairloss can provide a deeper understanding of patient discourse and may also represent an opportunity for physicians to disseminate evidence-based recommendations.</p>\n                </sec>",
        "link": "https://doi.org/10.2196/preprints.50918",
        "published": "2023-8-1",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis of Text Using Deep Learning-based Natural Language Processing Models",
        "abstract": "<jats:p>This paper conducts research on text sentiment analysis based on the current advanced deep-learning natural language technology. It includes data preprocessing for text sentiment analysis, the establishment of text sentiment analysis models based on deep learning natural language technology, and the training of text sentiment analysis models based on deep learning natural language technology. It is hoped that this analysis can provide a reference for the rational application of the model to achieve intelligent analysis of text sentiment.</jats:p>",
        "link": "https://doi.org/10.26689/erd.v6i12.9292",
        "published": "2025-1-6",
        "pdf_url": "https://ojs.bbwpublisher.com/index.php/erd/article/download/9292/8172",
        "pdf_path": "data/pdfs/Sentiment_Analysis_Using_Natural_Language_Processing_paper_182.pdf"
    },
    {
        "title": "VADER Natural Language Processing in Market Sentiment Analysis",
        "abstract": "",
        "link": "https://doi.org/10.2139/ssrn.3676706",
        "published": "2020-9-18",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "A review of sentiment analysis for Afaan Oromo: Current trends and future perspectives",
        "abstract": "",
        "link": "https://doi.org/10.1016/j.nlp.2023.100051",
        "published": "2023-12-28",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Emotion detection from text data using machine learning for human behavior analysis",
        "abstract": "",
        "link": "https://doi.org/10.1016/b978-0-443-22009-8.00008-2",
        "published": "2024-2-2",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis of Mixed-Case Language using Natural Language Processing",
        "abstract": "",
        "link": "https://doi.org/10.1109/icirca51532.2021.9544554",
        "published": "2021-10-2",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis on Product Features Based on Lexicon Approach Using Natural Language Processing",
        "abstract": "",
        "link": "https://doi.org/10.5121/ijnlc.2019.8301",
        "published": "2019-7-6",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Public discourse and sentiment during Mpox outbreak: an analysis using natural language processing",
        "abstract": "",
        "link": "https://doi.org/10.1016/j.puhe.2023.02.018",
        "published": "2023-4-3",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Natural language processing and sentiment analysis: perspectives from computational intelligence",
        "abstract": "",
        "link": "https://doi.org/10.1016/b978-0-32-390535-0.00007-0",
        "published": "2023-8-4",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Using bilingual knowledge and ensemble techniques for unsupervised Chinese sentiment analysis",
        "abstract": "",
        "link": "https://doi.org/10.3115/1613715.1613783",
        "published": "2010-4-15",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Natural Language Processing, Sentiment Analysis, and Clinical Analytics",
        "abstract": "",
        "link": "https://doi.org/10.1016/b978-0-12-819043-2.00003-4",
        "published": "2019-11-15",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis of Customer Reviews Using Machine Learning and Natural Language Processing Methods",
        "abstract": "<jats:p>The study aims to design a system using natural language processing (NLP) methods from ma-chine learning for sentiment analysis via Twitter. This system will classify comments from custom-ers who have used airline services, to analyze and categorize their sentiments. By analyzing the comments of customers who have used airline services, the aim is to improve the experiences of both customers and companies. The selected tweets will be classified as positive, negative, or neu-tral, and sentiment analysis will be conducted based on the results. Additionally, efforts will be made to predict which department within a company a comment is related to. Data will be obtained from the social media platform Twitter, and a sentiment analysis report will be produced using NLP. The Twitter API will be used for the application, leveraging Python libraries that utilize NLP meth-ods.</jats:p>",
        "link": "https://doi.org/10.52460/issc.2024.022",
        "published": "2024-12-11",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Classification of Hindi Language using Natural Language Processing Techniques",
        "abstract": "<jats:p>This paper has presented Hybrid Approach for determination of sentimental phrase or words from Hindi text automatically through use of Hindi sentiment’s lexicon and classifying them into polarity i.e. Positive, Negative and Neutral.</jats:p>",
        "link": "https://doi.org/10.55529/jlls.26.7.10",
        "published": "2022-11-28",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis of English Movie Reviews using Deep Learning",
        "abstract": "",
        "link": "https://doi.org/10.1145/3677779.3677789",
        "published": "2024-9-20",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Identifying hidden patterns of fake COVID-19 news: An in-depth sentiment analysis and topic modeling approach",
        "abstract": "",
        "link": "https://doi.org/10.1016/j.nlp.2024.100053",
        "published": "2024-1-5",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Analysis of Sentiment Towards Artificial Intelligent Industry Using Hybrid Natural Language Processing Technique",
        "abstract": "",
        "link": "https://doi.org/10.1109/icsecs58457.2023.10256397",
        "published": "2023-9-26",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment analysis and natural language processing using Reddit data to evaluate patient opinions on hair loss therapeutics (Preprint)",
        "abstract": "",
        "link": "https://doi.org/10.2196/50918",
        "published": "2024-6-21",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Analyzing the Amazon Shopping Experience: A Sentiment Analysis Based on Natural Language Processing (NLP) and Model Comparison",
        "abstract": "",
        "link": "https://doi.org/10.31274/cc-20240624-215",
        "published": "2024-6-26",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Preface",
        "abstract": "",
        "link": "https://doi.org/10.1016/b978-0-443-22009-8.00015-x",
        "published": "2024-2-2",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis and Emotion Detection using Text Mining in Natural Language Processing",
        "abstract": "<jats:p>Abstract\n\nThere are many studies being conducted in the field of natural language processing related to sentiment analysis due to the growth of computer science and social media. However, there are many applications of sentiment analysis, and it might be difficult for researchers to review and understand past studies in order to see the trends. Thus, this study proposes trends for sentiment analysis research to assist sentiment analysis researchers. The data sources we obtained from our collections are Google Scholar and Scopus. Therefore, reviews of studies that are using multiple types of modalities have examined change from a particular event and from language itself have been researched more frequently in the last few years. Sentiment analysis is a powerful driver of natural language processing with huge implications for business, social media, healthcare, and disaster response, among others. In this review, we explore the complex landscape of sentiment analysis, its implications, challenges, and recent trends. We cover several important topics, such as the best dataset to use, the best algorithm to use, whether to consider different languages, and various new sentiment tasks. We evaluate the applicability of existing datasets (e.g., IMDB Movie Reviews, Twitter Sentiment Dataset) and deep learning approaches (e.g., BERT) to sentiment analysis. There has been progress in sentiment analysis, however, emerging challenges remain (e.g., sarcasm and irony, ethical challenges, and new domains). We believe sentiment analysis is dynamic in nature, so future research is necessary to capture the complexity of sentiment expression exhibited by humans, as well as to ensure ethical and effective use of sentiment analysis across specializations and languages.\n\nKeywords: - IMDB Movie Reviews, Twitter Sentiment Dataset, support vector machine (SVM), Naive Bayes, Logistic Regression, social media, healthcare, and disaster response.</jats:p>",
        "link": "https://doi.org/10.55041/ijsrem49504",
        "published": "2025-6-4",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "A combined AraBERT and Voting Ensemble classifier model for Arabic sentiment analysis",
        "abstract": "",
        "link": "https://doi.org/10.1016/j.nlp.2024.100100",
        "published": "2024-8-28",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "An Integrated Deep Learning with Natural Language Processing Models for Sentiment Analysis and Classification using Arabic Tweets",
        "abstract": "<jats:p>The growing acceptance of social media networks as a platform to share opinions on several features emerged opinion mining or sentiment analysis (SA) as an active investigation part. In recent times, SA has attracted significant attention owing to its various applications in different features of our lives. SA is one of the Natural Language Processing (NLP) that purposes to analyze and process data that is transcribed in human languages. Even though the Arabic language is the most extensively spoken language utilized for content sharing through social media, the SA on Arabic content is restricted owing to numerous challenges with the language’s morphologic structures, the dialect's variabilities, and the absence of the proper corpora. In recent times, deep learning (DL) and machine learning (ML) have demonstrated extraordinary achievements in the field of SA for Arabic tweet classification in social media platforms. In this manuscript, we design and develop an Integrated Deep Learning with Natural Language Processing Models for Sentiment Analysis and Classification (IDLNLPM-SAC) technique. The IDLNLPM-SAC model presents a sentiment analysis and classification using Arabic tweets. The presented IDLNLPM-SAC model follows different levels of data preprocessing to transform the raw Arabic tweet data into a compatible format. For the process of word embedding, the latent semantic analysis (LSA) technique can be deployed. Besides, the hybrid of parallel temporal convolutional network–gated recurrent unit (PTCN-GRU) classifier can be implemented for the classification process. Eventually, the parameter choice of the PTCNGRU algorithm can be implemented by the design of the improved marine predator algorithm (IMPA). The simulation evaluation of the IDLNLPM-SAC technique takes place using the Arabic tweets database. The experimental results pointed out the heightened solution of the IDLNLPM-SAC technique compared to recent approaches.</jats:p>",
        "link": "https://doi.org/10.5121/csit.2024.142404",
        "published": "2024-12-26",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Dictionary for Business Cycle Analysis and its Applications",
        "abstract": "",
        "link": "https://doi.org/10.5715/jnlp.29.1233",
        "published": "2022-12-14",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Real-Time Market Sentiment Analysis Using Natural Language Processing and ML",
        "abstract": "",
        "link": "https://doi.org/10.1109/ic2pct60090.2024.10486228",
        "published": "2024-4-8",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Abusive comment detection in Tamil using deep learning",
        "abstract": "",
        "link": "https://doi.org/10.1016/b978-0-443-22009-8.00001-x",
        "published": "2024-2-2",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "A New Approach for Carrying Out Sentiment Analysis of Social Media Comments Using Natural Language Processing",
        "abstract": "",
        "link": "https://doi.org/10.3390/engproc2023059181",
        "published": "2024-1-18",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Sentiment Analysis of Multilingual Twitter Data using Natural Language Processing",
        "abstract": "",
        "link": "https://doi.org/10.1109/csnt.2018.8820254",
        "published": "2019-9-3",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Deep Learning in Sentiment Analysis",
        "abstract": "",
        "link": "https://doi.org/10.1007/978-981-10-5209-5_8",
        "published": "2018-5-23",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "Recognizing Euphemisms and Dysphemisms Using Sentiment Analysis",
        "abstract": "",
        "link": "https://doi.org/10.18653/v1/2020.figlang-1.20",
        "published": "2020-7-29",
        "pdf_url": null,
        "pdf_path": null
    },
    {
        "title": "SENTIMENT ANALYSIS OF STUDENTS’ FEEDBACK ON INSTITUTIONAL FACILITIES USING TEXT-BASED CLASSIFICATION AND NATURAL LANGUAGE PROCESSING (NLP)",
        "abstract": "<jats:p>In this study, sentiment analysis, commonly referred to as opinion mining or emotional artificial intelligence (AI), is used to obtain student comments about institutional facilities. To ascertain whether an online text has a good, negative, or neutral emotional tone, it must first be analyzed. Natural Language Processing (NLP) includes the subfield of sentiment analysis, and NLP can be used to categorize and extract information with the aid of machine learning methods. Finding out if students are content with the amenities or services provided is important since, in an educational setting, they are consumers. This study of the resources and services that the libraries offer evaluated college students' perceptions of the books, audio CDs, and video CDs, the services provided by the library staff, and the personal computers that are made available to them as part of their facilities. In the current study, surveys were carried out to gather information and assess how well the needs of the students are addressed. On Kaggle.com, secondary data from a North Indian institution was used in the experiments. The research approach was sentiment analysis using a machine learning framework. The F1-score, a harmonic mean of precision and recall based on the attitudes evaluated by the algorithms, was calculated using a text-based classification method using Naive Bayes Multinomial and Support Vector machine learning algorithms. The findings offer views on how successfully library facilities are managed in the form of student sentiments.</jats:p>",
        "link": "https://doi.org/10.47836/jlc.10.01.06",
        "published": "2023-4-8",
        "pdf_url": null,
        "pdf_path": null
    }
]